[{"id": "7169554de1d5d9cd", "image_file": "7169554de1d5d9cd.png", "context": "Brake System Warning Light This warning has the following functions: Warning light inspection For an operation check, make sure that the light turns on when the vehicle power is switched on, and turns off a few seconds later or when the hybrid system is started. When the light turns on The light turns on continuously if any one of the following occurs: Insufficient brake fluid Brake system (electronic brake force distribution system) has a problem Park the vehicle in a safe place immediately and contact an Authorized Mazda Dealer. Do not drive with the brake system warning light illuminated. Contact", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an exclamation mark with a circle drawn around it and the word \"BRAKE\" written below"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "45cc23450d0382d0", "image_file": "45cc23450d0382d0.png", "context": "Lead-Acid Battery Charging System Warning Light The light turns on if the charging system has a problem. Park the vehicle in a safe place immediately and contact an Authorized Mazda Dealer. Do not continue driving with the charging system warning light turned on: Otherwise, the hybrid system may stop, which could result in an accident. Close Warning View Warning", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a car battery with \"+\" and \"-\" symbols representing positive and negative terminals of the battery"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the vehicle’s charging system."}}, {"id": "2101a2e459630001", "image_file": "2101a2e459630001.png", "context": "Engine Oil Warning Light The light turns on when the engine oil pressure decreases. Do not drive the vehicle with the engine oil warning light turned on. Driving the vehicle with decreased engine oil pressure may cause engine damage. Close Caution View Caution If the engine oil warning light turns on while driving, stop the vehicle in a safe place and stop the hybrid system. After that, contact an Authorized Mazda Dealer.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an oil can, with a drop of oil dripping from the spout of the can"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s engine oil level is low."}}, {"id": "3731313150d4704c", "image_file": "3731313150d4704c.png", "context": "High Engine Coolant Temperature Warning Light The light turns on if the engine coolant temperature has increased excessively. Check the contents of the message displayed and take the necessary action. Do not drive the vehicle with the high engine coolant temperature warning light turned on. Driving the vehicle with the engine not cooled down may cause engine damage. Close Caution View Caution", "difficulty": 4, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a thermometer being dipped into a fluid"}, "functional_descriptions": {"ground-truth": "The icon indicates that the temperature of the vehicle’s engine is too high."}}, {"id": "669aae66a2aee266", "image_file": "669aae66a2aee266.png", "context": "Electric Power Steering Warning Light The warning light turns on if the electric power steering has a malfunction. If the warning light turns on, stop the vehicle in a safe place and switch the vehicle power OFF. There is no problem if the warning light turns off when the hybrid system is restarted after some time has passed. If the warning light turns on even after the hybrid system is restarted, contact an Authorized Mazda Dealer. If the warning light turns on, the electric power steering will not operate normally. In this case, the steering wheel can still be operated,", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a steering wheel with an exclamation mark next to it"}, "functional_descriptions": {"ground-truth": "This icon indicates that a fault has occurred in the vehicle’s electric power steering system."}}, {"id": "33cc9eb2a69ecc32", "image_file": "33cc9eb2a69ecc32.png", "context": "ABS Warning Light The light remains on if the system has a problem. Have your vehicle inspected by an Authorized Mazda Dealer. If the brake system warning light and the ABS warning light turn on at the same time, stop the vehicle in a safe place immediately and contact an Authorized Mazda Dealer. The rear wheels could lock more quickly in an emergency stop than under normal circumstances which could result in an accident. Close Warning View Warning", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letters \"ABS\" with a circle drawn around them"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle's anti-lock braking system."}}, {"id": "31316955d49692cc", "image_file": "31316955d49692cc.png", "context": "Master Warning Light The light turns on if the system has a problem. Check the contents of the message displayed on the center display or in the instrument cluster and take the necessary action.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark with a triangle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon is the master warning light and indicates that the driver should consult the warning message shown in the vehicle information display."}}, {"id": "32ce96969696cc32", "image_file": "32ce96969696cc32.png", "context": "Brake Control System Warning Light The light turns on if the system has a problem. Have your vehicle inspected by an Authorized Mazda Dealer.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "7171556df1d9f1f5", "image_file": "7171556df1d9f1f5.png", "context": "Electric Parking Brake (EPB) Indicator Light The light turns on when applying the parking brake and it turns off when releasing the parking brake. Parking brake warning/Indicator light inspection The light illuminates when the parking brake is applied with the vehicle power switched to START or ON. It turns off when the parking brake is released. Turning on If the light remains on even with the electric parking brake (EPB) switch turned off, the system may have a malfunction. Have the vehicle inspected by an Authorized Mazda Dealer. Flashing The light flashes if the system has a problem. If the", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the letter \"P\" with a circle drawn around it and the word \"PARK\" written below"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that the parking brake is activated. If the icon is flashing on and off it indicates that a fault has occurred in the parking brake."}}, {"id": "236cd694e4323434", "image_file": "236cd694e4323434.png", "context": "Brake Override Warning Indication This message is displayed when the accelerator pedal and brake pedal are depressed at the same time while driving. Release the accelerator pedal and depress the brake pedal.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber icon depicts two pedals: the brake pedal and the accelerator pedal. The outline of a footprint is shown touching both pedals."}, "functional_descriptions": {"ground-truth": "The icon indicates that both the brake and accelerator pedals are depressed at the same time while driving."}}, {"id": "6370de86b3c66e39", "image_file": "6370de86b3c66e39.png", "context": "Check Engine Warning Light Do not disconnect the lead-acid battery cables when the check engine warning light is turned on/flashing. The engine may be damaged when reconnecting the lead-acid battery cables, which could result in a fire. Close Warning View Warning The light turns on if the engine has a problem while it is running. Park the vehicle in a safe place immediately and contact an Authorized Mazda Dealer. If any of the following problems occur, the check engine warning light turns on. There is a problem with the hybrid system There is a problem with the emission control system", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle’s combustion engine"}, "functional_descriptions": {"ground-truth": "This icon indicates that an emissions-related fault has been detected with the vehicle’s engine"}}, {"id": "6d1032ee266e0601", "image_file": "6d1032ee266e0601.png", "context": "i-stop Warning Light (Amber) (Some Models) After the engine is started, the light turns on/flashes continuously if the system has a problem. Have the vehicle inspected by an Authorized Mazda Dealer.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the phrase \"i-stop.\""}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's i-stop anti-idling system."}}, {"id": "314a4cc4e4a4b44b", "image_file": "314a4cc4e4a4b44b.png", "context": "Automatic Transmission Warning Light The light turns on if the system has a problem. Contact an Authorized Mazda Dealer. Do not drive the vehicle with the automatic transmission warning light turned on. If the vehicle continues to be driven while the automatic transmission warning light is turned on, the transmission could be damaged. Have your vehicle inspected by an Authorized Mazda Dealer as soon as possible. Close Caution View Caution", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letters \"AT\"."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's automatic transmission."}}, {"id": "030494b1a96e2611", "image_file": "030494b1a96e2611.png", "context": "AWD Warning Light The light turns on if the system has a problem or if the tire sizes do not match. Check the contents of the message displayed and take the necessary action.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letters \"AWD\"."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's all-wheel drive system or that there is a mismatch in the sizes of the vehicle's tires."}}, {"id": "33694d496d6c4949", "image_file": "33694d496d6c4949.png", "context": "TCS/DSC Indicator Light (Turns on) There may be a problem with the DSC, TCS, or Hill Launch Assist (HLA) under the following conditions. Have your vehicle inspected by an Authorized Mazda Dealer. The light does not turn on or remains on even if the vehicle power is switched ON. It turns on while driving the vehicle.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle as seen from the rear. Below the vehicle are two wavy lines that represent skid marks."}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates a fault in the vehicle’s traction control system or hill launch assist system."}}, {"id": "2555586469614959", "image_file": "2555586469614959.png", "context": "Air Bag/Seat Belt Pretensioner System Warning Light A problem in the system might be indicated under the following conditions. Have your vehicle inspected by an Authorized Mazda Dealer. Does not turn on even if the vehicle power is switched ON. Remains turned-on/flashing. Never tamper with the air bag/pretensioner systems and always have an Authorized Mazda Dealer perform all servicing and repairs. Self-servicing or tampering with the systems is dangerous. An air bag/pretensioner could accidentally activate or become disabled causing serious injury or death. Close Warning View Warning", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a seated person wearing a seatbelt with an inflated airbag in front of them"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has been detected in one of the vehicle's airbag or seat belt safety systems."}}, {"id": "5554d49696d6c469", "image_file": "5554d49696d6c469.png", "context": "Tire Pressure Monitoring System (TPMS) Warning Light (Flashing) The light flashes if there is a malfunction in the system. Contact an Authorized Mazda Dealer. Do not drive the vehicle at high speeds if the TPMS warning light turns on or flashes: Driving the vehicle at high speeds while the TPMS warning light is turned on or flashing is dangerous because the brake performance and the steering wheel operability will be reduced. If the vehicle is driven at high speeds or the brakes are suddenly applied, it could lead to an accident. Gradually apply the brakes to lower the vehicle's speed.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark surrounded by a U-shaped symbol that represents a tire"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that tire pressure is low. If the icon is flashing on and off it indicates a fault in the tire pressure management system of the vehicle."}}, {"id": "033036d252541631", "image_file": "033036d252541631.png", "context": "KEY Warning Light (Red) The light turns on if the system has a problem or if the key is out of the operation range. Check the contents of the message displayed and take the necessary action. If the power switch indicator light (amber) flashes at the same time, the hybrid system may not start. Have the vehicle inspected by an Authorized Mazda Dealer as soon as possible. Close Caution View Caution", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a key with and exclamation mark on top."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's key or that the key is out of the operation range."}}, {"id": "1d685b9295859519", "image_file": "1d685b9295859519.png", "context": "Security Indicator Light If the security indicator light turns on/flashes while driving, do not stop the hybrid system (leave it operating) and have the vehicle inspected at an Authorized Mazda Dealer. If you stop the hybrid system , you may not be able to start it again. If the hybrid system cannot be started, switch the vehicle power OFF, place the key in another position within the operation range, and then restart the hybrid system. Check the security indicator light and if it does not turn off, such as it remains on or flashes, switch the vehicle power OFF, wait", "difficulty": 4, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a vehicle as seen from the front or rear. A padlock is shown on top of the vehicle."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's engine immobilizer that may prevent the engine from starting if it is shut off."}}, {"id": "1bd48a899996d83b", "image_file": "1bd48a899996d83b.png", "context": "High Beam Control System (HBC) Warning Light (Amber) (Some Models) The light turns on if the system has a problem. Have your vehicle inspected by an Authorized Mazda Dealer.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The letter \"A\" appears next to the headlight."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the active high beam feature of the headlights of the vehicle."}}, {"id": "713171544c713131", "image_file": "713171544c713131.png", "context": "i-ACTIVSENSE Warning Light The light turns on if any i-ACTIVSENSE related system has a problem. Check the contents of the message displayed and take the necessary action.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle as seen from above. Curved lines are emanating from the front, back and both sides of the vehicle."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's i-ACTIVSENSE related systems."}}, {"id": "707069d468695533", "image_file": "707069d468695533.png", "context": "Exterior Lights Warning Light The light turns on if the exterior lights (not including the license plate lights) has a problem. Have your vehicle inspected by an Authorized Mazda Dealer. Do not drive the vehicle while an exterior light has a malfunction. Poor visibility, and not being able to signal braking and turns may cause an accident. In addition, if the vehicle is driven with the lights not turned on, it may conflict with laws and regulations due to poor maintenance. Close Caution View Caution", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a lightbulb with seven lines emanating from it. An exclamation mark is shown inside the lightbulb."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's exterior lights."}}, {"id": "63795c7058585873", "image_file": "63795c7058585873.png", "context": "Low Fuel Warning Light The light turns on/flashes when the remaining fuel in the tank is near empty. When the light flashes, a warning sound is activated. Refuel immediately. The light illumination timing may vary because fuel inside the fuel tank moves around according to the driving conditions and the vehicle posture. Close Note View Note", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a fuel pump."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s fuel level is near empty."}}, {"id": "1dcdc8f831f5e125", "image_file": "1dcdc8f831f5e125.png", "context": "Check Fuel Cap Warning Light If the check fuel cap warning light illuminates while driving, the fuel-filler cap may not be installed properly. Stop the hybrid system and reinstall the fuel-filler cap.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a fuel cap next to a cross-section of a vehicle."}, "functional_descriptions": {"ground-truth": "The icon indicates the vehicle's fuel cap may not be installed properly."}}, {"id": "5d21a4d84a61cc92", "image_file": "5d21a4d84a61cc92.png", "context": "Engine Oil Level Warning Light This warning light indicates that the engine oil level is around the MIN mark. Do not continue to drive the vehicle with the engine oil level warning light turned on. If the vehicle continues to be driven with an insufficient amount of engine oil, it could cause damage to the engine. Close Caution View Caution Add 1 L (0.26 US gal, 0.22 Imp gal) of engine oil (Search) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an oil can, with a drop of oil dripping from the spout of the can. Below the oil can is a wavy line representing oil."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s engine oil level is low and near the minimum mark."}}, {"id": "6954549696d46169", "image_file": "6954549696d46169.png", "context": "Low Washer Fluid Amount Warning Light (Some Models) The light turns on if the amount of washer fluid is low when the vehicle power is switched ON. Add washer fluid.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle windshield with dashed lines depicting washer fluid being sprayed onto the windshield."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's windshield washer fluid levels are low."}}, {"id": "1530369292d43631", "image_file": "1530369292d43631.png", "context": "KEY Indicator Light (Green) (Flashing) The light flashes if the battery power of the key is low when the vehicle power is switched from ON to OFF. Replace the key battery.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a key with and exclamation mark on top."}, "functional_descriptions": {"ground-truth": "The icon indicates that the battery in the vehicle's key is low."}}, {"id": "051131d492540101", "image_file": "051131d492540101.png", "context": "Hybrid System Warning Light The light turns on if the hybrid system has a problem or a short circuit. Have your vehicle inspected by an Authorized Mazda Dealer. Do not open the hood. If you touch something in the engine compartment, it could lead to an electrical shock resulting in an accident. Close Warning View Warning If it turns on while driving, stopping the hybrid system will prevent the hybrid system from starting again. Close Caution View Caution", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a vehicle as seen from the side. An exclamation mark is shown on top of the vehicle."}, "functional_descriptions": {"ground-truth": "The icon indicates a short circuit or other fault with the vehicle's hybrid system."}}, {"id": "713149d8d44c6425", "image_file": "713149d8d44c6425.png", "context": "High Voltage Battery Temperature Warning Indication “Excessive High Voltage Battery Temperature. Drive Slowly” is displayed The indication displays if the high voltage battery temperature is excessively high. Drive slowly to reduce load on the high voltage battery. Stop the vehicle in a safe place if necessary. If the indication remains displayed, the system may have a problem. Have the vehicle inspected by an Authorized Mazda Dealer. “High Voltage Battery Temperature Is Low Acceleration Is Limited” is displayed The indication displays if the high voltage battery temperature is excessively low. The vehicle speed may not increase even if the accelerator pedal", "difficulty": 5, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a stack of vehicle batteries with \"-\" and \"+\" symbols indicating the negative and positive terminals of the batteries. The symbol for a thermometer is shown on top of the stack of batteries."}, "functional_descriptions": {"ground-truth": "The icon indicates excessively high temperatures in the vehicle's high voltage battery."}}, {"id": "4bd89c8a26deca60", "image_file": "4bd89c8a26deca60.png", "context": "Remaining High Voltage Battery Power Warning Light The light turns on/flashes when the remaining charge of the high voltage battery is low. In addition, when the light turns on/flashes, a warning sound is activated. Charge the battery as soon as possible.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a stack of vehicle batteries with \"-\" and \"+\" symbols indicating the negative and positive terminals of the batteries."}, "functional_descriptions": {"ground-truth": "This icon indicates that the vehicle's high voltage battery has a low charge."}}, {"id": "0519386468694131", "image_file": "0519386468694131.png", "context": "Charging System Warning Light The light turns on if the charging system has a problem. Have your vehicle inspected by an Authorized Mazda Dealer as soon as possible. Otherwise, the charging system may not charge the battery.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an electric cable with a plug on the end"}, "functional_descriptions": {"ground-truth": "This icon indicates a fault with the vehicle's charging system."}}, {"id": "0519b186c66c0231", "image_file": "0519b186c66c0231.png", "context": "Output Restriction Warning Light The light turns on/flashes under the following conditions. The vehicle speed may not increase even if the accelerator pedal is depressed High voltage battery level is low If necessary, park the vehicle in a safe place until the output restriction warning light turns off. When the output restriction warning light turns on or flashes, check the safety of the surroundings: The motor output decreases and the vehicle speed decreases, which could lead to an accident. If the vehicle cannot be driven safety, stop the vehicle in a safe place. Close Warning View Warning", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a turtle"}, "functional_descriptions": {"ground-truth": "The icon indicates a temporary fault in the vehicle driveline, resulting in reduced performance of the vehicle."}}, {"id": "157149d5d5493155", "image_file": "157149d5d5493155.png", "context": "Shift System Warning Light The light turns on if the shift system has a problem. Park the vehicle in a safe place immediately and contact an Authorized Mazda Dealer. Always apply the parking brake when parking or stopping the vehicle, as it may not be possible to hold the vehicle in a stopped position even with the selector lever in the P position. In addition, the hybrid system may not start again if it is stopped.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an exclamation mark inside a gear."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle's shift system."}}, {"id": "b28e962a6a948eb2", "image_file": "b28e962a6a948eb2.png", "context": "Do not drive with the brake system warning light illuminated. Contact an Authorized Mazda Dealer to have the brakes inspected as soon as possible. Driving with the brake system warning light illuminated is dangerous. It indicates that your brakes may not work at all or that they could completely fail at any time. If this light remains illuminated, after checking that the parking brake is fully released, have the brakes inspected immediately. If the brake system warning light and the ABS warning light turn on at the same time, stop the vehicle in a safe place immediately and contact an", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letters \"ABS\" with a circle drawn around them"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle's anti-lock braking system."}}, {"id": "f0d496d6d4d299aa", "image_file": "f0d496d6d4d299aa.png", "context": "If the brake system warning light and the ABS warning light turn on at the same time, stop the vehicle in a safe place immediately and contact an Authorized Mazda Dealer. The rear wheels could lock more quickly in an emergency stop than under normal circumstances which could result in an accident.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an exclamation mark with a circle drawn around it and the word \"BRAKE\" written below"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "05303694d5561271", "image_file": "05303694d5561271.png", "context": "KEY Warning Light (Red) The light turns on if the system has a problem or if the key is out of the operation range. Check the contents of the message displayed and take the necessary action. If the push button start indicator light (amber) flashes at the same time, the engine may not start. Have the vehicle inspected by an Authorized Mazda Dealer as soon as possible. Close Caution View Caution", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a key with and exclamation mark on top."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's key or that the key is out of the operation range."}}, {"id": "097c529ad2d2d218", "image_file": "097c529ad2d2d218.png", "context": "Security Indicator Light If the security indicator light turns on/flashes while driving, do not stop the engine (leave it operating) and have the vehicle inspected at an Authorized Mazda Dealer. If you stop the engine , you may not be able to start it again. If the engine cannot be started, switch the vehicle power OFF, place the key in another position within the operation range, and then restart the engine. Check the security indicator light and if it does not turn off, such as it remains on or flashes, switch the vehicle power OFF, wait for a while, and", "difficulty": 4, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a vehicle as seen from the front or rear. A padlock is shown on top of the vehicle."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's engine immobilizer that may prevent the engine from starting if it is shut off."}}, {"id": "310171386ccc114d", "image_file": "310171386ccc114d.png", "context": "Retractable Hardtop Warning Light (Some Models) The light turns on if there is a malfunction in the system. Have your vehicle inspected by an Authorized Mazda Dealer.", "difficulty": 5, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts part of a vehicle as seen from the side. The vehicle's roof is partially retracted."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's retractable hardtop roof."}}, {"id": "6379596161616163", "image_file": "6379596161616163.png", "context": "Low Fuel Warning Light The light turns on/flashes when the remaining fuel in the tank is near empty. When the light flashes, a warning sound is activated. Refuel immediately. The light illumination timing may vary because fuel inside the fuel tank moves around according to the driving conditions and the vehicle posture. Close Note View Note", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a fuel pump."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s fuel level is near empty."}}, {"id": "15303694d5d63631", "image_file": "15303694d5d63631.png", "context": "KEY Indicator Light (Green) (Flashing) The light flashes if the battery power of the key is low when the vehicle power is switched from ON to OFF. Replace the key battery.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a key with and exclamation mark on top."}, "functional_descriptions": {"ground-truth": "The icon indicates that the battery in the vehicle's key is low."}}, {"id": "4b1bc3c9e9c3030b", "image_file": "4b1bc3c9e9c3030b.png", "context": "Wrench Indicator Light The wrench indication/indicator light is displayed/turns on under the following conditions. When the preset maintenance period has arrived. Refer to the Mazda Connect “Vehicle Status Monitor”. When the maintenance period arrives, have your vehicle inspected by an Authorized Mazda Dealer as soon as possible. If maintenance is neglected, a decrease in vehicle performance may occur which could cause damage. Have your vehicle inspected before the maintenance period arrives. If the vehicle continues to be driven after the engine oil replacement period has passed, it could cause damage to the engine. Replace the engine oil before the maintenance", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a wrench."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle is due for scheduled maintenance."}}, {"id": "644c685a4b696579", "image_file": "644c685a4b696579.png", "context": "Rear Seat Alert Warning Light (Some Models) The warning light turns on continuously if the system has a problem. Have the vehicle inspected by an Authorized Mazda Dealer.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a seat with an exclamation mark on top. Above the seat the word \"REAR\" is shown."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's rear seat alert warning system"}}, {"id": "2141c8d6b6c0c121", "image_file": "2141c8d6b6c0c121.png", "context": "Wrench Indicator Light The wrench indication/indicator light is displayed/turns on under the following conditions. When the preset maintenance period has arrived. Refer to the Information section in the Mazda Connect Owner's Manual. When the maintenance period arrives, have your vehicle inspected by an Authorized Mazda Dealer as soon as possible. If maintenance is neglected, a decrease in vehicle performance may occur which could cause damage. Have your vehicle inspected before the maintenance period arrives. If the vehicle continues to be driven after the engine oil replacement period has passed, it could cause damage to the engine. Replace the engine oil", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a wrench."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle is due for scheduled maintenance."}}, {"id": "63e4c4e869d29aa8", "image_file": "63e4c4e869d29aa8.png", "context": "Air Bag Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a seated person wearing a seatbelt with an inflated airbag in front of them"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has been detected in one of the vehicle's safety systems."}}, {"id": "33cccc0d0f33c401", "image_file": "33cccc0d0f33c401.png", "context": "Battery Charge Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a car battery with \"+\" and \"-\" symbols representing positive and negative terminals of the battery"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the vehicle’s electrical system."}}, {"id": "00804796b22f5000", "image_file": "00804796b22f5000.png", "context": "Brake Warning Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"BRAKE\""}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "70694cf0f0f0f0e8", "image_file": "70694cf0f0f0f0e8.png", "context": "Door Open Warning\n                Light Door Open Warning Light — If Equipped", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the top view of a car with both the front doors (driver door and shotgun door) open"}, "functional_descriptions": {"ground-truth": "The icon indicates that one or more of the vehicle's doors are not properly closed."}}, {"id": "8966daa6dada6699", "image_file": "8966daa6dada6699.png", "context": "Electric Power Steering (EPS) Fault\n                Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a wrench with a thunder bolt going through the middle of it"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the electrical system."}}, {"id": "659a96f4d0b6ae59", "image_file": "659a96f4d0b6ae59.png", "context": "Electronic Throttle Control (ETC) Warning Light Electronic Throttle Control (ETC) Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a thunderbolt inside of two opposite side facing arcs that represent a throttle"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the vehicle's electronic throttle control system."}}, {"id": "36b1b171b0d4f0d4", "image_file": "36b1b171b0d4f0d4.png", "context": "Engine Coolant Temperature Warning Light Engine Coolant Temperature Warning Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts two rows of squiggly lines, which represent coolant, with the bottom row being a full squiggly line and the second row having two squiggly lines with a thermometer in the middle taking the temperature of the coolant"}, "functional_descriptions": {"ground-truth": "The icon indicates that the engine's coolant temperature is too high, meaning the engine is overheating."}}, {"id": "b000b4829acc0084", "image_file": "b000b4829acc0084.png", "context": "Hood Open Warning\n                Light Hood Open Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of an outline of a car with the hood open"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's hood is not properly closed."}}, {"id": "20007686128c0084", "image_file": "20007686128c0084.png", "context": "Liftgate Open\n                Warning Light Liftgate Open Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of an outline of a car with the trunk open"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's trunk is not properly closed."}}, {"id": "204c21a6dcc96205", "image_file": "204c21a6dcc96205.png", "context": "Oil\n                                Pressure Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a oil jug with a droplet, representing a droplet of oil, that fell from the tip of it"}, "functional_descriptions": {"ground-truth": "The icon indicates that the engine's oil pressure is too low."}}, {"id": "b6b1b1313694d962", "image_file": "b6b1b1313694d962.png", "context": "Oil\n                                Temperature Warning Light Oil Temperature Warning Light", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a oil jug with a droplet, representing a droplet of oil, that fell from the tip of it. There is a thermometer going into the oil jug from the top to represent the taking of the oil's temperature"}, "functional_descriptions": {"ground-truth": "The icon indicates that the engine oil temperature is too high."}}, {"id": "b2b1316979cce869", "image_file": "b2b1316979cce869.png", "context": "Seat Belt Reminder Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a seated person with a seatbelt across their chest and waist"}, "functional_descriptions": {"ground-truth": "The icon indicates that someone in the vehicle has not fastened their seat belt."}}, {"id": "71c496b2b296cc71", "image_file": "71c496b2b296cc71.png", "context": "Transmission Temperature Warning Light Transmission Temperature Warning Light — If Equipped", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a thermometer inside of a gear wheel"}, "functional_descriptions": {"ground-truth": "The icon indicates that the transmission fluid temperature is too high."}}, {"id": "3271c0d0d0c07133", "image_file": "3271c0d0d0c07133.png", "context": "Vehicle Security Warning Light Vehicle Security Warning Light — If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a circle that is filled in"}, "functional_descriptions": {"ground-truth": "The icon indicates a issue related to the vehicle's security system."}}, {"id": "00e4d9f06cb2a408", "image_file": "00e4d9f06cb2a408.png", "context": "Electric System Fail", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a wrench with a lightning bolt crossing through it."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's eletric system."}}, {"id": "c018f8d0d8e08000", "image_file": "c018f8d0d8e08000.png", "context": "Plugged In Indicator Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts an electrical plug"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle is connected to a charging source."}}, {"id": "b84238b0e44e8042", "image_file": "b84238b0e44e8042.png", "context": "Torque Limited Warning Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a turtle"}, "functional_descriptions": {"ground-truth": "The icon indicates a temporary fault in the vehicle driveline, resulting in reduced performance of the vehicle."}}, {"id": "e5929292aed2d2ca", "image_file": "e5929292aed2d2ca.png", "context": "Adaptive Cruise Control (ACC) Fault\n                Warning Light", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a meter with the back view of a car to it's top left and an exclamation mark to it's right"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the adaptive cruise control system."}}, {"id": "2cf3ad36268df32c", "image_file": "2cf3ad36268df32c.png", "context": "Electronic Park Brake Warning\n                Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the letter “P” with a circle drawn around it and there is an arc on the left side and right side outside the circle. To the right there is an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates an issue with your vehicle's electronic parking brake system."}}, {"id": "13e88eb2b28ee833", "image_file": "13e88eb2b28ee833.png", "context": "Anti-Lock Brake System (ABS) Warning\n                Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the letters \"ABS\" with a circle drawn around them and there is an arc on the left side and right side outside the circle"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle's anti-lock braking system."}}, {"id": "334c61696cec919a", "image_file": "334c61696cec919a.png", "context": "Electronic Stability Control (ESC)\n                Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a vehicle as seen from the rear. Below the vehicle are two wavy lines that represent skid marks"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Electronic Stability Control (ESC) system is currently active and working to help maintain vehicle stability."}}, {"id": "2969a924d0d9f5e1", "image_file": "2969a924d0d9f5e1.png", "context": "Electronic Stability Control (ESC)\n                OFF Warning Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a vehicle as seen from the rear. Below the vehicle are two wavy lines that represent skid marks and the word “OFF” appears"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Electronic Stability Control (ESC) system has been manually turned off or is not functioning properly."}}, {"id": "9c63e00eb3c67893", "image_file": "9c63e00eb3c67893.png", "context": "Engine Check/Malfunction Indicator Warning Light (MIL) Engine Check/Malfunction Indicator Warning Light (MIL)", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts an outline of an engine"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's engine management system has detected a problem."}}, {"id": "e19492d2c2d2d0d3", "image_file": "e19492d2c2d2d0d3.png", "context": "Low\n                                Fuel Warning Light Low Fuel Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a gas pump "}, "functional_descriptions": {"ground-truth": "The icon indicates that the fuel level in the vehicle's fuel tank is low and it's time to refuel soon."}}, {"id": "acbe93b8a6a4b4b4", "image_file": "acbe93b8a6a4b4b4.png", "context": "Active Lane Management Indicator Light Active Lane Management Indicator Light — If Equipped", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a dashed straight line representing a lane on the road and to the right of it a slanted top view of a car with a solid line representing another lane on the road. The head of the car is on top of the solid line lane"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's active lane keeping or lane departure warning system is active and operational with the vehicle perfectly centered in the lane."}}, {"id": "c2aab6e2c2c2e216", "image_file": "c2aab6e2c2c2e216.png", "context": "Fuel Level Sensor Failure Warning Light Fuel Level Sensor Failure Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a gas pump with an exclamation mark to the right of the gas pump"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle's fuel level sensor system."}}, {"id": "69d4d49696cc6196", "image_file": "69d4d49696cc6196.png", "context": "Low Washer Fluid Warning Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a windshield with some fluid at the bottom of the windshield making the shape of waves. Behind the windshield are dotted lines that make up the shape of an umbrella"}, "functional_descriptions": {"ground-truth": "The icon indicates that the windshield washer fluid level is low."}}, {"id": "a2a9caa6d4d2ac11", "image_file": "a2a9caa6d4d2ac11.png", "context": "Service AWD\n                Warning Light Service AWD Warning Light — If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"SERV\" which represents service and the word \"AWD\" which represents four wheel drive. The word \"AWD\" is under the word \"SERV\""}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a problem with the vehicle's 4WD system."}}, {"id": "a916add8d89b24d8", "image_file": "a916add8d89b24d8.png", "context": "Service Forward Collision Warning (FCW) Or Pedestrian Emergency\n                                Braking (PEB) Warning Light Service Forward Collision Warning (FCW) Or Pedestrian Emergency Braking (PEB) Warning Light — If Equipped", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the side view of the front half of a car that is travelling left with a bent star in front of the car to represent a collision. To the right of the car is an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle's forward collision warning system or pedestrian emergency braking system."}}, {"id": "293936324a6a2a2a", "image_file": "293936324a6a2a2a.png", "context": "Service Lanesense Warning Light", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a dashed straight line representing a lane on the road and to the right of it a slanted top view of a car with a solid line representing another lane on the road. The head of the car is on top of the solid line lane. To the right of all of this is an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates an issue with the vehicle's LaneSense system."}}, {"id": "24d3a726769c8b64", "image_file": "24d3a726769c8b64.png", "context": "Service Stop/Start System Warning Light Service Stop/Start System Warning Light — If Equipped", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the letter \"A\" that is circled by an arrow moving clockwise where it begins at bottom left corner of the \"A\" and ends at the bottom right corner of the \"A\". To the right of this is an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a problem with the vehicle's stop/start system."}}, {"id": "cc94b23333b294e0", "image_file": "cc94b23333b294e0.png", "context": "indirect Tire Pressure Monitoring\n                System (iTPMS) Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a flat tire with an exclamation mark in the middle of the tire"}, "functional_descriptions": {"ground-truth": "The icon indicates that there might be an issue with one or more of the tire's pressure."}}, {"id": "4ba6ccd0c8b9716b", "image_file": "4ba6ccd0c8b9716b.png", "context": "Forward Collision Warning (FCW) Or Pedestrian Emergency Braking\n                                (PEB) OFF Indicator Light Forward Collision Warning (FCW) Or Pedestrian Emergency Braking (PEB) OFF Indicator Light — If Equipped", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the side view of the front half of a car that is travelling left with a bent star in front of the car to represent a collision. Under is the word \"OFF\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the Forward Collision Warning (FCW) or Pedestrian Emergency Braking (PEB) system has been manually turned off or deactivated."}}, {"id": "b2f068b2b2b269b2", "image_file": "b2f068b2b2b269b2.png", "context": "Adaptive Cruise\n                Control (ACC) Set With Target Vehicle Detected Indicator Light Adaptive Cruise Control (ACC) Set With Target Vehicle Detected Indicator Light — If Equipped", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts two vehicles as seen from above. Four curved lines are shown emenating from the front of the rear vehicle towards the rear of the front vehicle."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's adaptive cruise control system is active and ready and that a target vehicle has been detected."}}, {"id": "7069f0b231697131", "image_file": "7069f0b231697131.png", "context": "Adaptive Cruise\n                Control (ACC) Ready Light Adaptive Cruise Control (ACC) Ready Light — If Equipped", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a vehicle as seen from above. Four curved lines are shown emenating from the front of the vehicle."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's adaptive cruise control system is active and ready."}}, {"id": "8699cee6dbdb466c", "image_file": "8699cee6dbdb466c.png", "context": "Cruise Control READY Indicator\n                Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a meter representing the speed meter with an arrow from it's top left pointing at it"}, "functional_descriptions": {"ground-truth": "The icon indicates that the cruise control system is enabled and ready for activation."}}, {"id": "99c8cad3d3ca9869", "image_file": "99c8cad3d3ca9869.png", "context": "Front Fog Indicator Light Front Fog Indicator Light — If Equipped", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a vehicle fog light with three horizontal lines representing beams of light emanating from the light. The horizontal lines are bisected by a vertical wavy line representing fog and the horizontal lines appear to the left of the light."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's front fog lights are turned on and actively illuminating the road ahead."}}, {"id": "71cc92b3abaed469", "image_file": "71cc92b3abaed469.png", "context": "Stop/Start Active Indicator Light Stop/Start Active Indicator Light — If Equipped", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the letter \"A\" that is circled by an arrow moving clockwise where it begins at bottom left corner of the \"A\" and ends at the bottom right corner of the \"A\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's engine stop/start system is actively engaged and operational."}}, {"id": "aa55cc9696cc55a2", "image_file": "aa55cc9696cc55a2.png", "context": "Park/Headlight On Indicator\n                Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts two headlights and each headlight symbol has three horizontal lines representing beams of light emanating from it. One headlight is facing left and the other headlight is facing right"}, "functional_descriptions": {"ground-truth": "The icon indicates that either the parking lights or the headlights are turned on."}}, {"id": "b255ccb2b2cc7184", "image_file": "b255ccb2b2cc7184.png", "context": "Turn Signal Indicator Lights GUID-F739ADAE-CA81-49AD-BE38-2378859CD539.html", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts two arrows beside each other, one is pointing left and the other is pointing right"}, "functional_descriptions": {"ground-truth": "The icon indicates that the corresponding turn signal is active and engaged."}}, {"id": "00929b717126ae10", "image_file": "00929b717126ae10.png", "context": "Max Regeneration\n                                Indicator Light Max Regeneration Indicator Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a battery with a thunder bolt it. On the outside of the battery, there are two arcs of arrows, where both arrow heads are clockwise. One arrow arc is on the left side of the battery aand the other arrow arc is on the right side of the battery"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's regenerative braking system is currently operating at its maximum capacity."}}, {"id": "00920096d0209200", "image_file": "00920096d0209200.png", "context": "Ready To Drive Indicator\n                Light GUID-DB3FF1E2-DD1A-42FA-AE17-0F1F8FD09DD4.html", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"READY\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's systems are ready for operation."}}, {"id": "73d4c62332b296d4", "image_file": "73d4c62332b296d4.png", "context": "Cruise Control Ready Indicator Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a meter representing the speed meter"}, "functional_descriptions": {"ground-truth": "The icon indicates that the cruise control system is enabled and ready for activation."}}, {"id": "aa9696aa51d48520", "image_file": "aa9696aa51d48520.png", "context": "Set Speed Display\n                Indicator Light Set Speed Display Indicator Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"XXX\" representing a number for the speed and the word \"MPH\" which represents miles per hour. The word \"MPH\" is under the word \"XXX\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's cruise control system is active, and the speed at which the cruise control is set is being displayed."}}, {"id": "239886a3a396d823", "image_file": "239886a3a396d823.png", "context": "High Beam Indicator Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the high beam headlights of the vehicle are on."}}, {"id": "7161ccf0f0e86971", "image_file": "7161ccf0f0e86971.png", "context": "Door Open Warning Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the top view of a car with every door open"}, "functional_descriptions": {"ground-truth": "The icon indicates that one or more of the vehicle's doors are not properly closed."}}, {"id": "6062e098a9c8d071", "image_file": "6062e098a9c8d071.png", "context": "Drowsy Driver\n                Detected Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a cup. Three wavy lines above the cup represent the idea that the cup contains a hot drink."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's driver alert system has detected that the driver is drowsy."}}, {"id": "904bb4ca2b8ed423", "image_file": "904bb4ca2b8ed423.png", "context": "Hood Open Warning Light Hood Open Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of an outline of a car with the hood open"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's hood is not properly closed."}}, {"id": "200770c636980b80", "image_file": "200770c636980b80.png", "context": "Liftgate Open Warning Light Liftgate Open Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of an outline of a car with the trunk open"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's trunk is not properly closed."}}, {"id": "0500a9979da900a9", "image_file": "0500a9979da900a9.png", "context": "SOS Battery Fault Warning Light — If Equipped", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a battery with \"SOS\" written in the middle of it and an exclamation mark to the right of the battery"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the backup battery for the emergency call system."}}, {"id": "d826a5a02626d827", "image_file": "d826a5a02626d827.png", "context": "Traction Battery Fault Warning\n                Light GUID-A1062051-5BA0-488E-84EA-C56C5F7A2D97.html", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a car battery in a stack of car batteries with \"+\" and \"-\" symbols representing positive and negative terminals of the battery and an exclamation mark between the positive and negative terminal of the battery"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the vehicle's traction battery system."}}, {"id": "5265d6929296c471", "image_file": "5265d6929296c471.png", "context": "Transmission Fault Warning Light GUID-B22D1BC4-601A-4E34-91D1-6B96A83393E3.html", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts an exclamation mark inside of a gear wheel"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the transmission system."}}, {"id": "42b48a6af86c8b70", "image_file": "42b48a6af86c8b70.png", "context": "Acoustic Vehicle Alerting System\n                Fault Warning Light", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of a car with a speaker outputting sound to the top left of it and an exclamation mark to the right of it"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the system responsible for generating sound in electric and hybrid vehicles to alert pedestrians and cyclists of their presence."}}, {"id": "64f39b6b93dc5c60", "image_file": "64f39b6b93dc5c60.png", "context": "Active Speed Limiter Fault Indicator\n                Light Active Speed Limiter Fault Warning Light — If Equipped", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"LIM\" to represent limit with a speed meter on top of the word positioned slightly more left. There is also an exclamation mark to the top right of the word"}, "functional_descriptions": {"ground-truth": "The icon indicates  that there is a issue with the vehicle's active speed limiter system."}}, {"id": "4017a5e713a34b10", "image_file": "4017a5e713a34b10.png", "context": "Auto Liftgate Fault Indicator\n                Light Auto Liftgate Fault Warning Light — If Equipped", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of an outline of a car where only the rear of the car is visible and has the trunk open. To the right of the trunk is the letter \"A\" that stands for auto and further right is an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a problem with the vehicle's automatic liftgate system."}}, {"id": "649a9a82bbf93748", "image_file": "649a9a82bbf93748.png", "context": "Blind Spot Detection System\n                Failure", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the outline of a car with two arcs that symbolize the blind spot zone in it's bottom left corner and the outline of another car to the bottom left of the arcs. To the right of this, there is also an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the blind spot monitoring system."}}, {"id": "03c0c7c3a181c045", "image_file": "03c0c7c3a181c045.png", "context": "Drowsy Driver\n                Detected System Fault Warning Light Drowsy Driver Detected System Fault Warning Light — If Equipped", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a cup on a saucer with an excalamation mark to the right of it. Three wavy lines above the cup represent the idea that the cup contains a hot drink"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's driver assistance system has detected signs that you may be drowsy or fatigued."}}, {"id": "960096b4b0960096", "image_file": "960096b4b0960096.png", "context": "Electronic Stability Control (ESC)\n                Active Warning Light Electronic Stability Control (ESC) Active Warning Light — If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"ESC\" which stands for electronic stability control"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Electronic Stability Control (ESC) system is currently active and working to help maintain vehicle stability."}}, {"id": "96b4b19694748494", "image_file": "96b4b19694748494.png", "context": "Electronic Stability Control (ESC)\n                OFF Warning Light Electronic Stability Control (ESC) OFF Warning Light — If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"ESC\" which stands for electronic stability control and the word \"OFF\". The word \"OFF\" is under the word \"ESC\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the Electronic Stability Control (ESC) system has been manually turned off or is not functioning properly."}}, {"id": "9768486872f2621f", "image_file": "9768486872f2621f.png", "context": "Fuel Cutoff Warning Light Fuel Cutoff Warning Light — If Equipped", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a gas pump with a slash going through the middle of the gas pump taking visibility priority over the gas pump"}, "functional_descriptions": {"ground-truth": "The icon indicates the vehicle's fuel cutoff system has been activated."}}, {"id": "00eabad2e2c2c204", "image_file": "00eabad2e2c2c204.png", "context": "Fuel Cutoff Failure Warning\n                Light Fuel Cutoff Failure Warning Light — If Equipped", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a gas pump with a slash going through the middle of the gas pump. An exclamation mark is shown next to the pump."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's fuel cutoff system."}}, {"id": "265eb85cbcbcd622", "image_file": "265eb85cbcbcd622.png", "context": "Keyless System Failure Indicator\n                Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of a lock key with the head being on the right. There are three curved lines representing a signal that are going north west from the lock key head"}, "functional_descriptions": {"ground-truth": "The icon indicates  an issue with the vehicle's keyless entry and start system."}}, {"id": "9562e2c2c6b2324d", "image_file": "9562e2c2c6b2324d.png", "context": "Forward Collision Warning (FCW)\n                Fault Light/Camera Blinded", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of half a car and a car representing a collision with a bent star above the collision area and an arrow pointing west under the full car. There is also an exclamation mark to the right of the full car"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Forward Collision Warning (FWC) is not functioning properly due to an issue with the camera."}}, {"id": "5a59b16464e0a829", "image_file": "5a59b16464e0a829.png", "context": "Towing Hook Breakdown Warning\n                Light Towing Hook Breakdown Warning Light — If Equipped", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a car trailer with a triangle above it. Inside the triangle is an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the vehicle's towing hook system."}}, {"id": "6b94cc6719ae5384", "image_file": "6b94cc6719ae5384.png", "context": "Traction Battery Cut-off Warning\n                Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a car battery with \"+\" and \"-\" symbols representing positive and negative terminals of the battery. The battery is crossed by a single line"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem or fault related to the traction battery system in hybrid or electric vehicles."}}, {"id": "e29a8a8a9ad22e8a", "image_file": "e29a8a8a9ad22e8a.png", "context": "Traffic Sign Recognition (TSR) Fault\n                Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a circle on top of a rectangle representing a traffic sign witth an excalamation mark to the right of it"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the system responsible for recognizing and displaying traffic signs to the drive."}}, {"id": "b2aa4dd44df09671", "image_file": "b2aa4dd44df09671.png", "context": "Exterior Lights Failure Indicator\n                Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a exterior light on a vehicle with lines coming out which represents light. Inside the exterior light is an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a problem with one or more of the exterior lights on your vehicle."}}, {"id": "32b2d4e8cc6c7561", "image_file": "32b2d4e8cc6c7561.png", "context": "Forward Collision Warning (FCW) OFF\n                Indicator Light", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of half a car and a car representing a collision with a bent star above the collision area and an arrow pointing west under the full car. At the bottom is the word \"OFF\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the forward collision warning system in the vehicle has been manually deactivated or turned off."}}, {"id": "8d78d2b2d292926d", "image_file": "8d78d2b2d292926d.png", "context": "Immobilizer Fail / VPS Electrical\n                Alarm Warning Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the back view of a car and a locked key lock to the right of it. The bottom right part of the car is not visible as part of the lock is occupying the space there"}, "functional_descriptions": {"ground-truth": "The icon indicates an issue with the vehicle's immobilizer system or the Vehicle Protection System (VPS)."}}, {"id": "e299646559dc4ee1", "image_file": "e299646559dc4ee1.png", "context": "Active Speed Limiter SET Indicator\n                Light Active Speed Limiter SET Indicator Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"LIM\" to represent limit with a speed meter on top of the word positioned slightly more left"}, "functional_descriptions": {"ground-truth": "The icon indicates that the active speed limiter system is engaged and a specific speed limit has been set by the driver."}}, {"id": "22006a52526a0048", "image_file": "22006a52526a0048.png", "context": "Auto HOLD Indicator Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"HOLD\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the Auto Hold function is currently active and engaged."}}, {"id": "26d9c68b8a949966", "image_file": "26d9c68b8a949966.png", "context": "Auto Low Beams Indicator Light Automatic Low Beam Indicator Light — If Equipped", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a vehicle headlight with five diagonal lines representing beams of light emanating from the headlight. The letter “A” appears on top of the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the active low beam feature of the headlights of the vehicle is activated and the headlights are on."}}, {"id": "800092aaa6960080", "image_file": "800092aaa6960080.png", "context": "Ready To Drive Indicator Light Ready To Drive Indicator Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"READY\" in a text bubble with a background"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's systems are ready for operation."}}, {"id": "00c1130a0a2cc409", "image_file": "00c1130a0a2cc409.png", "context": "E-Drive Electric Mode Indicator\n                Light E-Drive Electric Mode Indicator Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"EV\" which stands for electric vehicle"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle is operating in an electric mode or hybrid mode where the electric motor is primarily powering the vehicle."}}, {"id": "0ef17854d5e1708f", "image_file": "0ef17854d5e1708f.png", "context": "PowerShot Unavailable Indicator\n                Light PowerShot Available Indicator Light", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a series of curved lines that form a circular shape which represent motion or energy. Inside this circle, there is a thunder bolt symbol which represents power"}, "functional_descriptions": {"ground-truth": "The icon indicates that PowerShot is unavailable."}}, {"id": "27d896ad8d96d926", "image_file": "27d896ad8d96d926.png", "context": "Automatic High Beam Indicator\n                Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The letter “A” appears next to the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the active high beam feature of the headlights of the vehicle is activated and the headlights are on."}}, {"id": "0020964898124800", "image_file": "0020964898124800.png", "context": "Sport Mode On Indicator Light Sport Mode On Indicator Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"SPORT\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the sport mode feature in the vehicle is activated and engaged."}}, {"id": "71cc96a2b2d4f0b2", "image_file": "71cc96a2b2d4f0b2.png", "context": "Active Driving Assist\n                                On Indicator Light Active Driving Assist On Indicator Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts three lines, two outer solid lines and one dashed line in the middle representing two lanes on the road. On top of the road is a steering wheel"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's active driving assist system is enabled and ready to assist the driver."}}, {"id": "b4b269c4b6ba0bf4", "image_file": "b4b269c4b6ba0bf4.png", "context": "Night Vision Animal\n                                Warning Light Night Vision Animal Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a deer inside of a triangle which represents a traffic sign of potential deer crossing the road"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's night vision system has detected an animal on or near the road and to proceed with caution."}}, {"id": "b4b269d492b22bc4", "image_file": "b4b269d492b22bc4.png", "context": "Night Vision\n                                Pedestrian Warning Light Night Vision Pedestrian Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a person inside of a triangle which represents a traffic sign of potential people crossing the road"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's night vision system has detected a pedestrian on or near the road and to proceed with caution."}}, {"id": "23cccc552faa54aa", "image_file": "23cccc552faa54aa.png", "context": "Traction Battery\n                                Coolant Fluid Level Low Warning Lights Traction Battery Coolant Fluid Level Low Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a car battery with \"+\" and \"-\" symbols representing positive and negative terminals of the battery. At the bottom, inside the battery, there are waves that represent coolant fluid"}, "functional_descriptions": {"ground-truth": "The icon indicates that the coolant level in the traction battery system is too low."}}, {"id": "4110f21333961084", "image_file": "4110f21333961084.png", "context": "Hybrid Electric\n                                Vehicle System Failure Warning Light Hybrid Electric Vehicle System Failure Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of an outline of a car with an exclamation mark in the middle of the car taking visibility priority over the car"}, "functional_descriptions": {"ground-truth": "The icon indicates an issue within the hybrid electric vehicle system."}}, {"id": "60d399e1a9ab2964", "image_file": "60d399e1a9ab2964.png", "context": "Active Driving Assist\n                                Fault Warning Light Active Driving Assist Fault Warning Light — If Equipped", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts three lines, two outer solid lines and one dashed line in the middle representing two lanes on the road. On top of the road is a steering wheel. To the right of this is an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates that there is an issue with the vehicle's Active Driving Assist system."}}, {"id": "03842beb57992201", "image_file": "03842beb57992201.png", "context": "Air Suspension Fault\n                                Warning Light Air Suspension Fault Warning Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of an outline of a car that is flattened with an exclamation mark to the right of the car"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault in the vehicle's air suspension system."}}, {"id": "0831e8cad4d47502", "image_file": "0831e8cad4d47502.png", "context": "Service 4WD Warning Light Service 4WD Warning Light — If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"SERV\" which represents service and the word \"4WD\" which represents four wheel drive. The word \"4WD\" is under the word \"SERV\""}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a problem with the vehicle's 4WD system."}}, {"id": "45aad292dac2d22d", "image_file": "45aad292dac2d22d.png", "context": "Sway Bar Fault Warning\n                                Light Sway Bar Fault Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"SWAY\" and the word \"BAR\" which represents a stabilizer bar. The word \"BAR\" is under the word \"SWAY\". To the right is an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the vehicle's sway bar system, also known as the stabilizer bar or anti-roll bar."}}, {"id": "4dd4f4d4a6bca45b", "image_file": "4dd4f4d4a6bca45b.png", "context": "4WD\n                                Low Indicator Light 4WD Low Indicator Light — If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"4WD\" which represents four wheel drive and the word \"LOW\". The word \"LOW\" is under the word \"4WD\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's four-wheel-drive (4WD) system has been engaged into low-range mode."}}, {"id": "31f082dce48afc30", "image_file": "31f082dce48afc30.png", "context": "Air\n                                Suspension Active Indicator Light Air Suspension Active Indicator Light — If Equipped", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts two straight lines representing the ground or road. On top of both these lines is the side view of an outline of a car. The cars on the line are shown in a vertical manner and on the very top is a triangle representing up and on the very bottom is an upside down triangle representing down"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's air suspension system is actively adjusting the ride height or damping characteristics."}}, {"id": "2a042aa98d628842", "image_file": "2a042aa98d628842.png", "context": "Air\n                                Suspension Aerodynamic Height Indicator Light Air Suspension Aerodynamic Height Indicator Light— If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"AERO\" which stands for aerodynamics"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's air suspension system is adjusting the ride height for aerodynamic purposes."}}, {"id": "cc00988879700040", "image_file": "cc00988879700040.png", "context": "Air\n                                Suspension Entry/Exit Indicator Light Air Suspension Entry/Exit Indicator Light— If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"ENTRY\" and the word \"EXIT\". The word \"EXIT\" is under the word \"ENTRY\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's air suspension system is adjusting the ride height to facilitate easier entry or exit from the vehicle."}}, {"id": "00a6cc8e10500000", "image_file": "00a6cc8e10500000.png", "context": "Air\n                                Suspension Off-Road 1 Indicator Light Air Suspension Off-Road 1 Indicator Light — If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the words \"OFF RD\" which stands for off road and the number \"1\". The number \"1\" is under the words \"OFF RD\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's air suspension system has been adjusted to Off-Road 1 mode which provides moderate increase in ride height and suspension settings for low to moderate off-road conditions."}}, {"id": "00a6cc8e10b03000", "image_file": "00a6cc8e10b03000.png", "context": "Air\n                                Suspension Off-Road 2 Indicator Light Air Suspension Off-Road 2 Indicator Light — If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the words \"OFF RD\" which stands for off road and the number \"2\". The number \"2\" is under the words \"OFF RD\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's air suspension system has been adjusted to Off-Road 1 mode which provides higher increase in ride height and suspension settings for challenging off-road conditions."}}, {"id": "24806c5754688028", "image_file": "24806c5754688028.png", "context": "Auto HOLD! Fault Indicator Light Auto HOLD! Fault Indicator Light — If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"HOLD\""}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the Auto Hold system of the vehicle."}}, {"id": "b234e81333ecd092", "image_file": "b234e81333ecd092.png", "context": "Max\n                                Payload Exceeded Indicator Light Max Payload Exceeded Indicator Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of an outline of a car with a slash going through the middle of the car taking visibility priority over the car. On top of the car is a triangle representing up and on the bottom is an upside down triangle representing down"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's maximum payload / weight capacity has been exceeded."}}, {"id": "0024009a8e002800", "image_file": "0024009a8e002800.png", "context": "NEUTRAL Indicator Light NEUTRAL Indicator Light — If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"NEUTRAL\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's transmission is currently in neutral gear."}}, {"id": "518aaaa854d44817", "image_file": "518aaaa854d44817.png", "context": "Sway Bar Indicator\n                                Light Sway Bar Indicator Light — If Equipped", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"SWAY\" and the word \"BAR\" which represents a stabilizer bar. The word \"BAR\" is under the word \"SWAY\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's sway bar (also known as stabilizer bar or anti-roll bar) system is actively engaged or functioning."}}, {"id": "704d4d69d4c47961", "image_file": "704d4d69d4c47961.png", "context": "Traffic Sign Recognition (TSR) OFF\n                Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a traffic sign with the word \"OFF\" under it"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Traffic Sign Recognition system in the vehicle has been manually turned off or disabled."}}, {"id": "b2716973b2626932", "image_file": "b2716973b2626932.png", "context": "Adaptive Cruise Control (ACC) Set With Target Indicator Light Adaptive Cruise Control (ACC) Set With Target Indicator Light — If Equipped", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts top view of a car that is travelling up where the back of it is out of the picture. In front of the car is four thick solid lines each of different length representing distance. On top, after the four lines, is the top view of the trunk of a car"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Adaptive Cruise Control (ACC) system is ready to be activated and used by the driver."}}, {"id": "e969697261696971", "image_file": "e969697261696971.png", "context": "Adaptive Cruise Control (ACC) Ready Indicator Light Adaptive Cruise Control (ACC) Ready Indicator Light — If Equipped", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts top view of a car that is travelling up where the back of it is out of the picture. In front of the car is four thick solid lines each of different length representing distance"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Adaptive Cruise Control (ACC) system h is active and set to maintain a specific speed chosen by the driver, but it has not detected a vehicle ahead to follow or maintain distance from."}}, {"id": "40c0999564ee6a4a", "image_file": "40c0999564ee6a4a.png", "context": "Night Vision Suppressed Indicator Light Night Vision Suppressed Indicator Light — If Equipped", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts three lines, two outer solid lines and one dashed line in the middle representing two lanes on the road. o the upper left of the road is a waning crescent moon"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's night vision system is temporarily disabled or suppressed."}}, {"id": "48c4a5a4828ae833", "image_file": "48c4a5a4828ae833.png", "context": "Selec-Speed Control Indicator Light Selec-Speed Control Indicator Light — If Equipped", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the side view of an outline of a car on a wavy line that represents a bumpy road or terrain. Above the car is a speed meter with a thick arrow pointing to it on its bottom left"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's Selec-Speed Control system is active and engaged."}}, {"id": "8060c2d298b80050", "image_file": "8060c2d298b80050.png", "context": "Sport Mode Indicator Light Sport Mode Indicator Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a two by two checkered sports flag"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's Sport mode is active and engaged."}}, {"id": "6249c99832cef063", "image_file": "6249c99832cef063.png", "context": "Hill Descent Control (HDC) Indicator Light Hill Descent Control (HDC) Indicator Light — If Equipped", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a slanted line representing a road on a hill with a slanted side view of an outline of a car on top of the line. Above the car is a speed meter with a thick arrow pointing to it on its bottom left"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's Hill Descent Control system is activated and ready to assist the driver when descending steep hills or challenging terrain."}}, {"id": "b2694dd4d4d4d4d4", "image_file": "b2694dd4d4d4d4d4.png", "context": "Rear Seat Unoccupied Indicator Light Rear Seat Unoccupied Indicator Light — If Equipped", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a front view of a rear seat in the car"}, "functional_descriptions": {"ground-truth": "The icon indicates that the rear seat in the vehicle is currently unoccupied."}}, {"id": "000413acaed32c00", "image_file": "000413acaed32c00.png", "context": "Electric Mode\n                                Indicator Light Electric Mode Indicator Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"ELECTRIC\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle is currently operating in electric mode."}}, {"id": "2a15eabab6479000", "image_file": "2a15eabab6479000.png", "context": "Hybrid Mode Indicator\n                                Light Hybrid Mode Indicator Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"HYBRID\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle is currently operating in hybrid mode."}}, {"id": "2a156a6a224b2000", "image_file": "2a156a6a224b2000.png", "context": "e-Save Indicator\n                                Light e-Save Indicator Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"e-SAVE\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the e-Save function in a hybrid or plug-in hybrid vehicle is active."}}, {"id": "0472696870616916", "image_file": "0472696870616916.png", "context": "Door Open Warning Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the top view of a car with the door to the shotgun seat open"}, "functional_descriptions": {"ground-truth": "The icon indicates that one or more of the vehicle's doors are not properly closed."}}, {"id": "09e6d2c2e2c2d229", "image_file": "09e6d2c2e2c2d229.png", "context": "E—Latch Fault Warning Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the top view of a car with the door to the shotgun seat open and an exclamation mark to the right of it"}, "functional_descriptions": {"ground-truth": "The icon indicates that there is an issue with the electronic latch system."}}, {"id": "8412b8cc80c400a0", "image_file": "8412b8cc80c400a0.png", "context": "Hood Open Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of a car with the hood open"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's hood is not properly closed."}}, {"id": "249038ec80c400a0", "image_file": "249038ec80c400a0.png", "context": "Rear Cargo Door Warning Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a side view of a car with the trunk open"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's trunk is not properly closed."}}, {"id": "a843ab9995ab5001", "image_file": "a843ab9995ab5001.png", "context": "SOS Fault Warning Light — If Equipped GUID-E18E449E-4669-4037-98F9-09266B72E9B7.html", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"SOS\" with an exclamation mark to the right of it"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the emergency call system."}}, {"id": "02d91c5a1ec2e200", "image_file": "02d91c5a1ec2e200.png", "context": "Low High-Voltage Battery Charge GUID-83E4362D-38FD-41CD-9896-55100E9FF576.html#GUID-83E4362D-38FD-41CD-9896-55100E9FF576", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a car battery in a stack of car batteries with \"+\" and \"-\" symbols representing positive and negative terminals of the battery"}, "functional_descriptions": {"ground-truth": "The icon indicates that the high-voltage battery is running low on charge."}}, {"id": "0493a99bbaa99304", "image_file": "0493a99bbaa99304.png", "context": "Automatic High Beam Warning\n                Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight with the letter 'A' inside of the headlight and an exclamation mark to the right of the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates an issue with the automatic high beam system."}}, {"id": "9368d4971796e833", "image_file": "9368d4971796e833.png", "context": "Brake Failure", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts an exclamation mark with a circle drawn around it and there is an arc on the left side and right side outside the circle"}, "functional_descriptions": {"ground-truth": "The icon indicates a problem with the vehicle's braking system."}}, {"id": "0966e2c2c2e2e204", "image_file": "0966e2c2c2e2e204.png", "context": "Drowsiness Detected Warning\n                Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a cup on a saucer with an excalamation mark to the right of it. Three wavy lines above the cup represent the idea that the cup contains a hot drink"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's driver assistance system has detected signs that you may be drowsy or fatigued."}}, {"id": "82308282b89a4290", "image_file": "82308282b89a4290.png", "context": "Park Sensor System Failure", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the letter \"P\" to represent \"Parking\" with 3 lines curved represent a signal to overall represent a parking sensor. To the right of this there is a triangle with a line underneath it to represent a warning sign and to the right of the triangle there is an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates an issue with the vehicle's parking sensor system."}}, {"id": "d827e3d9d3e34b94", "image_file": "d827e3d9d3e34b94.png", "context": "Rain Sensor Failure Indicator\n                Light", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a cloud that has 4 left slanted lines with two longer ones and two shorter ones following a pattern of long-short-long-short representing rain. To the right of the cloud and rain is an exclamation markj"}, "functional_descriptions": {"ground-truth": "The icon indicates an issue with the vehicle's rain-sensing system."}}, {"id": "48a0a4f219cc160a", "image_file": "48a0a4f219cc160a.png", "context": "Service Required/Call For Service\n                Warning Light", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a wrench"}, "functional_descriptions": {"ground-truth": "The icon indicates indicates that your vehicle requires maintenance or service."}}, {"id": "5826a2b8a702a500", "image_file": "5826a2b8a702a500.png", "context": "Speed Limiter Failure GUID-BF82A5C1-CC86-4484-8CB7-8E543055065C.html", "difficulty": 2, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"LIM\" followed by an exclamation mark"}, "functional_descriptions": {"ground-truth": "The icon indicates an issue with the vehicle's speed limiter system."}}, {"id": "e6d6d6d6566698e6", "image_file": "e6d6d6d6566698e6.png", "context": "Twilight Sensor Fault Warning\n                Light", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"AUTO\" where on top is a lightbulb and to the right of the lightbulb is an exclamation mark. Inside the lightbulb is a small circle that is surrounded by a ring of squares which represent the sun"}, "functional_descriptions": {"ground-truth": "The icon indicates an issue with the twilight sensor system."}}, {"id": "4859596971006062", "image_file": "4859596971006062.png", "context": "Lane Keeping Assist OFF", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a slanted car inbetween two lanes representing a road where the head of the car is over one of the lanes"}, "functional_descriptions": {"ground-truth": "The icon indicates that the lane keeping assist system in your vehicle has been manually turned off or disabled."}}, {"id": "694dd4e8a2d46869", "image_file": "694dd4e8a2d46869.png", "context": "Icy Road Condition Indicator\n                Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a snowflake representing ice and freezing temperatures and behind the snowflake is a road to represent icy conditions on the road"}, "functional_descriptions": {"ground-truth": "The icon indicates that there are potentially hazardous road conditions due to ice or freezing temperatures."}}, {"id": "006080c1f0dc2cd5", "image_file": "006080c1f0dc2cd5.png", "context": "Press Brake Indicator Light", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a shoe representing the driver's foot on a pedal representing the brake pedal"}, "functional_descriptions": {"ground-truth": "The icon indicates that the driver need to press the brake pedal in order to start the vehicle, especially in vehicles equipped with keyless ignition systems."}}, {"id": "3ae5acb4b4ac651a", "image_file": "3ae5acb4b4ac651a.png", "context": "Rear Fog Indicator Light", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts a vehicle fog light with three horizontal lines representing beams of light emanating from the fog light. The horizontal lines are bisected by a vertical wavy line representing fog and the horizontal lines appear to the right of the light, which indicates a rear light"}, "functional_descriptions": {"ground-truth": "The icon indicates that the rear fog lights are on."}}, {"id": "45919282acd6da5b", "image_file": "45919282acd6da5b.png", "context": "Adaptive Cruise Control (ACC)", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the back view of a car and to the bottom right of it is a meter representing the speed meter. To the right of the car and top right of the meter, there is an arrow that is pointing at the meter"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Adaptive Cruise Control (ACC) system is active and engaged."}}, {"id": "ec91b6acc4d4cc4c", "image_file": "ec91b6acc4d4cc4c.png", "context": "Intelligent Adaptive Cruise Control\n                READY (ACC)", "difficulty": 5, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the back view of a car and to the bottom right of it is a meter representing the speed meter blocking the back right tire of the car. To the right of the car and top right of the meter, there is an arrow that is pointing at the meter. Inbetween the car and the sign and on top of the meter is a circular traffic sign"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Intelligent Adaptive Cruise Control (ACC) system is enabled and ready to be activated by the driver"}}, {"id": "003e0c2c28b89900", "image_file": "003e0c2c28b89900.png", "context": "Intelligent Speed Assist READY", "difficulty": 3, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"LIM\" and to the top right of the word is a circular traffic sign"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Intelligent Speed Assist system (ISA) is enabled and ready to assist the driver with speed regulation."}}, {"id": "9000d4d4dccc00c4", "image_file": "9000d4d4dccc00c4.png", "context": "Speed Limiter READY", "difficulty": 1, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the word \"LIM\""}, "functional_descriptions": {"ground-truth": "The icon indicates that the Speed Limiter system is enabled and ready for activation by the driver."}}, {"id": "45909280a456db4b", "image_file": "45909280a456db4b.png", "context": "Adaptive Cruise Control READY\n                (ACC)", "difficulty": 4, "visual_descriptions": {"ground-truth": "This dashboard icon depicts the back view of a car and to the bottom right of it is a meter representing the speed meter"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Adaptive Cruise Control (ACC) system is enabled and ready to be activated by the driver."}}, {"id": "14b26955d496b2c4", "image_file": "14b26955d496b2c4.png", "context": "WARNING The red warning symbol illuminates to indicate that a fault has been detected that could affect safety or driveability. An explanatory message will be simultaneously displayed in the instrument panel. The warning symbol may also illuminate in combination with other symbols.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an exclamation mark with a triangle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has been detected that could affect safety or driveability of the vehicle."}}, {"id": "323130696dc8aa29", "image_file": "323130696dc8aa29.png", "context": "Seat belt reminder Lights up or flashes when a someone in the vehicle has not fastened their seat belt.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a seated person with a seatbelt across their chest and waist"}, "functional_descriptions": {"ground-truth": "The icon indicates that someone in the vehicle has not fastened their seat belt."}}, {"id": "1265646869d29a64", "image_file": "1265646869d29a64.png", "context": "Airbags A fault has been detected in one of the vehicle's safety systems. Read the message in the instrument panel and contact a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a seated person wearing a seatbelt with an inflated airbag in front of them"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has been detected in one of the vehicle's safety systems."}}, {"id": "1671d49696c47016", "image_file": "1671d49696c47016.png", "context": "1 2 Fault in brake system A fault has occurred in the brake system. Read the message in the instrument panel and contact a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an exclamation mark with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "000006d0d8260000", "image_file": "000006d0d8260000.png", "context": "1 2 Fault in brake system A fault has occurred in the brake system. Read the message in the instrument panel and contact a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the word \"BRAKE\""}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "0670c49296cc7006", "image_file": "0670c49296cc7006.png", "context": "1 2 Parking brake Steady glow: the parking brake is activated. Flashing: a fault has occurred in the parking brake. Read the message in the instrument panel.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the letter \"P\" with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that the parking brake is activated. If the icon is flashing on and off it indicates that a fault has occurred in the parking brake."}}, {"id": "00259aecb4120901", "image_file": "00259aecb4120901.png", "context": "1 2 Parking brake Steady glow: the parking brake is activated. Flashing: a fault has occurred in the parking brake. Read the message in the instrument panel.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the word \"PARK\""}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that the parking brake is activated. If the icon is flashing on and off it indicates that a fault has occurred in the parking brake."}}, {"id": "224dcc8c8ea2c401", "image_file": "224dcc8c8ea2c401.png", "context": "Fault in electrical system A fault has occurred in the electrical system. Read the message in the instrument panel and contact a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a car battery with \"+\" and \"-\" symbols representing positive and negative terminals of the battery"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the vehicle’s electrical system."}}, {"id": "0669c4f0c4d69661", "image_file": "0669c4f0c4d69661.png", "context": "Assistance at risk of collision Warns the driver if there is a risk of a collision with another vehicle, pedestrian, cyclist or large animal.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a vehicle as seen from the front or rear. Features of the vehicle that can be seen include the windshield, body, wheels and side mirrors."}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a risk of a collision with another vehicle, pedestrian, cyclist or large animal."}}, {"id": "f08eb2b2b2b28ef0", "image_file": "f08eb2b2b2b28ef0.png", "context": "Information A problem has occurred in one of the vehicle's systems. Read the message in the instrument panel. The information symbol may also illuminate in combination with other symbols.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letter \"i\" with a square drawn around it"}, "functional_descriptions": {"ground-truth": "The icon represents an information symbol and indicates that a problem has occurred in one of the vehicle’s systems."}}, {"id": "17e8d49696d4f017", "image_file": "17e8d49696d4f017.png", "context": "1 2 Fault in brake system A fault has occurred in the brake system. Read the message in the instrument panel.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "001026da9a275000", "image_file": "001026da9a275000.png", "context": "1 2 Fault in brake system A fault has occurred in the brake system. Read the message in the instrument panel.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the word \"BRAKE\""}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "33e88eb2b28ee833", "image_file": "33e88eb2b28ee833.png", "context": "1 2 Fault in ABS system The system is not functioning properly. The vehicle's regular brakes will still work, but without the ABS function.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letters \"ABS\" with a circle drawn around them"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle's anti-lock braking system."}}, {"id": "5429d6d4b2b64920", "image_file": "5429d6d4b2b64920.png", "context": "1 2 Fault in ABS system The system is not functioning properly. The vehicle's regular brakes will still work, but without the ABS function.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letters \"ABS\""}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle's anti-lock braking system."}}, {"id": "9966e4b4b6e4649a", "image_file": "9966e4b4b6e4649a.png", "context": "Rear fog light Rear fog light on.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle fog light with three horizontal lines representing beams of light emanating from the fog light. The horizontal lines are bisected by a vertical wavy line representing fog and the horizontal lines appear to the right of the light, which indicates a rear light."}, "functional_descriptions": {"ground-truth": "The icon indicates that the rear fog lights are on."}}, {"id": "08d496b2b292d450", "image_file": "08d496b2b292d450.png", "context": "Tire pressure system Tire pressure low. If there is a fault in the tire pressure system, the symbol will first flash for approximately one minute and then glow steadily. This may occur if the system cannot detect or alert the driver of low tire pressure.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark surrounded by a U-shaped symbol that represents a tire"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that tire pressure is low. If the icon is flashing on and off it indicates a fault in the tire pressure management system of the vehicle."}}, {"id": "8c31f0b269e8320c", "image_file": "8c31f0b269e8320c.png", "context": "Fault in headlight system A fault has occurred in the headlight system. Read the message in the instrument panel.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle headlight with five vertical lines representing beams of light emanating from the headlight. Next to the vertical lines are two arrows, one arrow points to the left and other points to the right."}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the headlight system."}}, {"id": "04226955d496b24d", "image_file": "04226955d496b24d.png", "context": "Lane Keeping Aid Lane Keeping Aid is alerting/intervening.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a road with lane markings"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s Lane Keeping Aid is active and alerting/intervening."}}, {"id": "304eb1f9ec649326", "image_file": "304eb1f9ec649326.png", "context": "Reduced performance Temporary fault in driveline. Read the message in the instrument panel.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a turtle"}, "functional_descriptions": {"ground-truth": "The icon indicates a temporary fault in the vehicle driveline, resulting in reduced performance of the vehicle."}}, {"id": "2969706c64ecd964", "image_file": "2969706c64ecd964.png", "context": "Stability system Steady glow: a fault has occurred in the system. Flashing: the system is working.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle as seen from the rear. Below the vehicle are two wavy lines that represent skid marks."}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates a fault in the vehicle’s stability system. If the icon is flashing on and off it indicates the stability system is active and working."}}, {"id": "106866d5d2e6b44b", "image_file": "106866d5d2e6b44b.png", "context": "Assistance during collision risks System not available The system for assistance during collision risks is not available or is working but performance is reduced.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts two vehicles. The front of one vehicle is close to the rear of the other vehicle and above the vehicles is an exclamation mark with a triangle drawn around it."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s system for assistance during collision risks is not available or is working but performance of that system is reduced."}}, {"id": "1204d4d4d4d8db24", "image_file": "1204d4d4d4d8db24.png", "context": "Active high beam Active high beam is activated and on.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This blue dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The letter \"A\" appears next to the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the active high beam feature of the headlights of the vehicle is activated and the headlights are on."}}, {"id": "26d9d8d6d6d8d926", "image_file": "26d9d8d6d6d8d926.png", "context": "High beams High beams on.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This blue dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the high beam headlights of the vehicle are on."}}, {"id": "22ddc8cacac8cd32", "image_file": "22ddc8cacac8cd32.png", "context": "Front fog light Front fog light on.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle fog light with three horizontal lines representing beams of light emanating from the fog light. The horizontal lines are bisected by a vertical wavy line representing fog and the horizontal lines appear to the left of the light, which indicates a front light."}, "functional_descriptions": {"ground-truth": "The icon indicates that the front fog lights are on."}}, {"id": "4892cce8e8cc9248", "image_file": "4892cce8e8cc9248.png", "context": "Parking lights Parking lights on.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts two lights and each light symbol has three horizontal lines representing beams of light emanating from it"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s parking lights are on."}}, {"id": "48b564e4e464b548", "image_file": "48b564e4e464b548.png", "context": "Left/right turn signals Turn signal in use.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts an arrow pointing to the left"}, "functional_descriptions": {"ground-truth": "The icon indicates that the left turn signal is in use."}}, {"id": "0c12d9d8c8d912ac", "image_file": "0c12d9d8c8d912ac.png", "context": "Left/right turn signals Turn signal in use.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts an arrow pointing to the right"}, "functional_descriptions": {"ground-truth": "The icon indicates that the right turn signal is in use."}}, {"id": "23d094aca284d926", "image_file": "23d094aca284d926.png", "context": "Active high beam Active high beam is activated but not on.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The letter \"A\" appears next to the headlight."}, "functional_descriptions": {"ground-truth": "The icon indicates that the active high beam feature of the headlights of the vehicle is activated but the headlights are off."}}, {"id": "138c78da96e09926", "image_file": "138c78da96e09926.png", "context": "Vehicle key not found Error reading key at start. Place the key on the key symbol in the cup holder and try again.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a vehicle seen from the front. The windshield, body, tires and side mirror are visible. A symbol for a lock is superimposed on the vehicle."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle key is not found or there was an error reading the key when starting the vehicle."}}, {"id": "17f0ccaaaaccf017", "image_file": "17f0ccaaaaccf017.png", "context": "Hold brake when stationary Hold brake when stationary is activated.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts the letter \"H\" with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that hold brake when stationary feature of the vehicle is activated."}}, {"id": "246273d49ccde1f5", "image_file": "246273d49ccde1f5.png", "context": "Driver Alert Driver Alert is activated.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a cup and saucer. Three wavy lines above the cup represent the idea that the cup contains a hot drink."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s driver alert system is activated."}}, {"id": "304bb492b0a54210", "image_file": "304bb492b0a54210.png", "context": "Cold battery The battery has reduced capacity due to low temperature. The battery charge could drop significantly if the vehicle is parked in cold ambient temperatures.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a snowflake next to a battery with reduced charge"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s battery has reduced capacity due to low temperature."}}, {"id": "44a26955d496b24d", "image_file": "44a26955d496b24d.png", "context": "Lane Keeping Aid White symbol: Lane Keeping Aid is activated and lane markings have been detected. Gray symbol: Lane Keeping Aid is activated but lane markings have not been detected.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a road with lane markings"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Lane Keeping Aid is active and lane markings have been detected."}}, {"id": "8679e8aee4719248", "image_file": "8679e8aee4719248.png", "context": "Rain sensor The rain sensor is activated.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a windshield with a window wiper. A single raindrop is shown on the windshield."}, "functional_descriptions": {"ground-truth": "The icon indicates that the rain sensor is activated."}}, {"id": "0670d49696d47006", "image_file": "0670d49696d47006.png", "context": "1 2 Fault in brake system A fault has occurred in the brake system. Read the message in the instrument panel and contact a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an exclamation mark with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "106866d5d0e6b44b", "image_file": "106866d5d0e6b44b.png", "context": "Assistance during collision risks System not available The system for assistance during collision risks is not available or is working but performance is reduced.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts two vehicles. The front of one vehicle is close to the rear of the other vehicle and above the vehicles is an exclamation mark with a triangle drawn around it."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s system for assistance during collision risks is not available or is working but performance of that system is reduced."}}, {"id": "48b564e4ec64b548", "image_file": "48b564e4ec64b548.png", "context": "Left/right turn signals Turn signal in use.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts an arrow pointing to the left"}, "functional_descriptions": {"ground-truth": "The icon indicates that the left turn signal is in use."}}, {"id": "8c12d9c8c8d912ac", "image_file": "8c12d9c8c8d912ac.png", "context": "Left/right turn signals Turn signal in use.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts an arrow pointing to the right"}, "functional_descriptions": {"ground-truth": "The icon indicates that the right turn signal is in use."}}, {"id": "0631317190d4c055", "image_file": "0631317190d4c055.png", "context": "High engine temperature The engine's temperature is too high. Read the message in the instrument panel.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a thermometer being dipped into a fluid"}, "functional_descriptions": {"ground-truth": "The icon indicates that the temperature of the vehicle’s engine is too high."}}, {"id": "0059a6a4d9621440", "image_file": "0059a6a4d9621440.png", "context": "Low oil pressure The engine's oil pressure is too low. Switch off the engine immediately and check the engine oil level. Add oil if necessary. If this symbol lights up and the oil level is normal, read the message in the instrument panel and contact a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an oil can, with a drop of oil dripping from the spout of the can"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s oil level is low."}}, {"id": "0c73e00e31c66491", "image_file": "0c73e00e31c66491.png", "context": "Emission control system Fault in emission control system. Have the vehicle checked by a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle’s combustion engine"}, "functional_descriptions": {"ground-truth": "This icon indicates that an emissions-related fault has been detected with the vehicle’s engine"}}, {"id": "17aa9692b28ef017", "image_file": "17aa9692b28ef017.png", "context": "1 Auto-hold brake The function is activated and the brakes or the parking brake are being used.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts the letter \"A\" with a circle drawn around it."}, "functional_descriptions": {"ground-truth": "This icon indicates that the vehicle's auto-hold brake function is active and brakes or parking brake are engaged"}}, {"id": "2b545454d5d5d4c8", "image_file": "2b545454d5d5d4c8.png", "context": "Preconditioning Engine and passenger compartment heater/air conditioning is preconditioning the vehicle.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts three wavy arrows that point upward. The arrows appear above a horizontal line."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's preconditioning system is active and the engine area and passenger compartment are being heated/cooled as appropriate."}}, {"id": "b04bb4b2b0a50210", "image_file": "b04bb4b2b0a50210.png", "context": "Hybrid battery charging Hybrid battery charging.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a lightning bolt next to a battery with reduced charge"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s battery is charging."}}, {"id": "30cb949ab8c43b80", "image_file": "30cb949ab8c43b80.png", "context": "The hybrid battery is maintaining its charge The hybrid battery is maintaining its charge", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a padlock next to a battery with reduced charge"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s battery is maintaining its charge level."}}, {"id": "4d332955d496c455", "image_file": "4d332955d496c455.png", "context": "WARNING The red warning symbol illuminates to indicate that a fault has been detected that could affect safety or driveability. An explanatory message will be simultaneously displayed in the instrument panel. The warning symbol may also illuminate in combination with other symbols.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an exclamation mark with a triangle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has been detected that could affect safety or driveability of the vehicle."}}, {"id": "3331316969e8a833", "image_file": "3331316969e8a833.png", "context": "Seat belt reminder Lights up or flashes when a someone in the vehicle has not fastened their seat belt.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a seated person with a seatbelt across their chest and waist"}, "functional_descriptions": {"ground-truth": "The icon indicates that someone in the vehicle has not fastened their seat belt."}}, {"id": "1265646869d39b65", "image_file": "1265646869d39b65.png", "context": "Airbags A fault has been detected in one of the vehicle's safety systems. Read the message in the instrument panel and contact a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a seated person wearing a seatbelt with an inflated airbag in front of them"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has been detected in one of the vehicle's safety systems."}}, {"id": "33e896969696a831", "image_file": "33e896969696a831.png", "context": "1 2 Fault in brake system A fault has occurred in the brake system. Read the message in the instrument panel and contact a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an exclamation mark with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "012105d29a270101", "image_file": "012105d29a270101.png", "context": "1 2 Fault in brake system A fault has occurred in the brake system. Read the message in the instrument panel and contact a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the word \"BRAKE\""}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "11a296b2b686a813", "image_file": "11a296b2b686a813.png", "context": "1 2 Parking brake Steady glow: the parking brake is activated. Flashing: a fault has occurred in the parking brake. Read the message in the instrument panel.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the letter \"P\" with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that the parking brake is activated. If the icon is flashing on and off it indicates that a fault has occurred in the parking brake."}}, {"id": "8901aba864550101", "image_file": "8901aba864550101.png", "context": "1 2 Parking brake Steady glow: the parking brake is activated. Flashing: a fault has occurred in the parking brake. Read the message in the instrument panel.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the word \"PARK\""}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that the parking brake is activated. If the icon is flashing on and off it indicates that a fault has occurred in the parking brake."}}, {"id": "924dcc8c8eb2c001", "image_file": "924dcc8c8eb2c001.png", "context": "Fault in electrical system A fault has occurred in the electrical system. Read the message in the instrument panel and contact a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a car battery with \"+\" and \"-\" symbols representing positive and negative terminals of the battery"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the vehicle’s electrical system."}}, {"id": "0731b13190d4d055", "image_file": "0731b13190d4d055.png", "context": "High engine temperature The engine's temperature is too high. Read the message in the instrument panel.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a thermometer being dipped into a fluid"}, "functional_descriptions": {"ground-truth": "The icon indicates that the temperature of the vehicle’s engine is too high."}}, {"id": "8669c4d4e0cccc33", "image_file": "8669c4d4e0cccc33.png", "context": "Collision risk City Safety warns the driver if there is a risk of a collision with another vehicle, pedestrian, cyclist or large animal.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a vehicle as seen from the front or rear. Features of the vehicle that can be seen include the windshield, body, wheels and side mirrors."}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a risk of a collision with another vehicle, pedestrian, cyclist or large animal."}}, {"id": "a159a6a4d9630501", "image_file": "a159a6a4d9630501.png", "context": "Low oil pressure The engine's oil pressure is too low. Switch off the engine immediately and check the engine oil level. Add oil if necessary. If this symbol lights up and the oil level is normal, read the message in the instrument panel and contact a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an oil can, with a drop of oil dripping from the spout of the can"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s oil level is low."}}, {"id": "69d4b2b2b2b2cc73", "image_file": "69d4b2b2b2b2cc73.png", "context": "Information A problem has occurred in one of the vehicle's systems. Read the message in the instrument panel. The information symbol may also illuminate in combination with other symbols.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letter \"i\" with a square drawn around it"}, "functional_descriptions": {"ground-truth": "The icon represents an information symbol and indicates that a problem has occurred in one of the vehicle’s systems."}}, {"id": "33e896969696e833", "image_file": "33e896969696e833.png", "context": "1 2 Fault in brake system A fault has occurred in the brake system. Read the message in the instrument panel.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "022107d29a2f5101", "image_file": "022107d29a2f5101.png", "context": "1 2 Fault in brake system A fault has occurred in the brake system. Read the message in the instrument panel.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the word \"BRAKE\""}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "d42bd4d4d2b44ba4", "image_file": "d42bd4d4d2b44ba4.png", "context": "1 2 Fault in ABS system The system is not functioning properly. The vehicle's regular brakes will still work, but without the ABS function.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letters \"ABS\""}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle's anti-lock braking system."}}, {"id": "8d63e00e31c66891", "image_file": "8d63e00e31c66891.png", "context": "Emission control system Fault in emission control system. Have the vehicle checked by a workshop. Volvo recommends contacting an authorized Volvo workshop.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle’s combustion engine"}, "functional_descriptions": {"ground-truth": "This icon indicates that an emissions-related fault has been detected with the vehicle’s engine"}}, {"id": "6ce5b4b4b4b4e465", "image_file": "6ce5b4b4b4b4e465.png", "context": "Rear fog light Rear fog light on.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle fog light with three horizontal lines representing beams of light emanating from the fog light. The horizontal lines are bisected by a vertical wavy line representing fog and the horizontal lines appear to the right of the light, which indicates a rear light."}, "functional_descriptions": {"ground-truth": "The icon indicates that the rear fog lights are on."}}, {"id": "2bd4d4b2b294cc23", "image_file": "2bd4d4b2b294cc23.png", "context": "Tire pressure system Tire pressure low. If there is a fault in the tire pressure system, the symbol will first flash for approximately 1 minute and then glow steadily. This may occur if the system cannot detect or alert the driver of low tire pressure as intended.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark surrounded by a U-shaped symbol that represents a tire"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that tire pressure is low. If the icon is flashing on and off it indicates a fault in the tire pressure management system of the vehicle."}}, {"id": "9669aaaa4d69b34d", "image_file": "9669aaaa4d69b34d.png", "context": "Fault in headlight system A fault has occurred in the headlight system. Read the message in the instrument panel.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle headlight with five vertical lines representing beams of light emanating from the headlight. Next to the vertical lines are two arrows, one arrow points to the left and other points to the right."}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the headlight system."}}, {"id": "16696d54d496b26d", "image_file": "16696d54d496b26d.png", "context": "Lane Keeping Aid Lane Keeping Aid is alerting/intervening.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a road with lane markings"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s Lane Keeping Aid is active and alerting/intervening."}}, {"id": "699671b8e46699a4", "image_file": "699671b8e46699a4.png", "context": "Reduced performance Temporary fault in driveline. Read the message in the instrument panel.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a turtle"}, "functional_descriptions": {"ground-truth": "The icon indicates a temporary fault in the vehicle driveline, resulting in reduced performance of the vehicle."}}, {"id": "b16c686d64e4d9d9", "image_file": "b16c686d64e4d9d9.png", "context": "Stability system Steady glow: a fault has occurred in the system. Flashing: the system is working.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle as seen from the rear. Below the vehicle are two wavy lines that represent skid marks."}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates a fault in the vehicle’s stability system. If the icon is flashing on and off it indicates the stability system is active and working."}}, {"id": "b2696929e9dbe94b", "image_file": "b2696929e9dbe94b.png", "context": "Stability system, Sport mode Sport mode is activated.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle as seen from the rear. Below the vehicle are two wavy lines that represent skid marks and the word “OFF” appears."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s dynamic stability control system is switched off. "}}, {"id": "8b54d49c9294d926", "image_file": "8b54d49c9294d926.png", "context": "Active high beam Active high beam is activated and on.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This blue dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The letter \"A\" appears next to the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the active high beam feature of the headlights of the vehicle is activated and the headlights are on."}}, {"id": "843bd8949694d926", "image_file": "843bd8949694d926.png", "context": "High beams High beams on.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This blue dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the high beam headlights of the vehicle are on."}}, {"id": "17aa9696b28ef017", "image_file": "17aa9696b28ef017.png", "context": "1 Auto-hold brake The function is activated and the brakes or the parking brake are being used.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts the letter \"A\" with a circle drawn around it."}, "functional_descriptions": {"ground-truth": "This icon indicates that the vehicle's auto-hold brake function is active and brakes or parking brake are engaged"}}, {"id": "4958d2d2d2d25849", "image_file": "4958d2d2d2d25849.png", "context": "Front fog light Front fog light on.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle fog light with three horizontal lines representing beams of light emanating from the fog light. The horizontal lines are bisected by a vertical wavy line representing fog and the horizontal lines appear to the left of the light, which indicates a front light."}, "functional_descriptions": {"ground-truth": "The icon indicates that the front fog lights are on."}}, {"id": "88338ec8c88e3345", "image_file": "88338ec8c88e3345.png", "context": "Parking lights Parking lights on.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts two lights and each light symbol has three horizontal lines representing beams of light emanating from it"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s parking lights are on."}}, {"id": "269978e6e6781946", "image_file": "269978e6e6781946.png", "context": "Left/right turn signals Turn signal in use.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts an arrow pointing to the left"}, "functional_descriptions": {"ground-truth": "The icon indicates that the left turn signal is in use."}}, {"id": "9966e19898e16699", "image_file": "9966e19898e16699.png", "context": "Left/right turn signals Turn signal in use.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts an arrow pointing to the right"}, "functional_descriptions": {"ground-truth": "The icon indicates that the right turn signal is in use."}}, {"id": "8339948c8a84d926", "image_file": "8339948c8a84d926.png", "context": "Active high beam Active high beam is activated but not on.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The letter \"A\" appears next to the headlight."}, "functional_descriptions": {"ground-truth": "The icon indicates that the active high beam feature of the headlights of the vehicle is activated but the headlights are off."}}, {"id": "2bd45454d5d5d4e8", "image_file": "2bd45454d5d5d4e8.png", "context": "Preconditioning Engine and passenger compartment heater/air conditioning is preconditioning the vehicle.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts three wavy arrows that point upward. The arrows appear above a horizontal line."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's preconditioning system is active and the engine area and passenger compartment are being heated/cooled as appropriate."}}, {"id": "aa5555d496b2b24d", "image_file": "aa5555d496b2b24d.png", "context": "Lane Keeping Aid White symbol: Lane Keeping Aid is on and lane marker lines are detected. Gray symbol: Lane Keeping Aid is on but no lane marker lines are detected.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a road with lane markings"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Lane Keeping Aid is active and lane markings have been detected."}}, {"id": "8e69c89aa6e47192", "image_file": "8e69c89aa6e47192.png", "context": "Rain sensor The rain sensor is activated.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a windshield with a window wiper. A single raindrop is shown on the windshield."}, "functional_descriptions": {"ground-truth": "The icon indicates that the rain sensor is activated."}}, {"id": "00b2c49696ccf000", "image_file": "00b2c49696ccf000.png", "context": "Brake system warning A fault is detected in the brake system. Take immediate action and contact an authorised Volvo workshop.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an exclamation mark with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "00f2c4b2b6ccf000", "image_file": "00f2c4b2b6ccf000.png", "context": "Parking brake warning Continuous illumination indicates that the parking brake is engaged. Flashing indicates a parking brake fault.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the letter \"P\" with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that the parking brake is activated. If the icon is flashing on and off it indicates that a fault has occurred in the parking brake."}}, {"id": "104cccbeccae8200", "image_file": "104cccbeccae8200.png", "context": "Low battery voltage warning The car's battery has a low voltage. Charge it as soon as possible.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts car battery with \"+\" and \"-\" symbols representing positive and negative terminals of the battery"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the vehicle’s electrical system."}}, {"id": "004218facacc44a2", "image_file": "004218facacc44a2.png", "context": "Power system failure warning A fault is detected in the car's power system. Take immediate action and contact an authorised Volvo workshop.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a vehicle as seen from the side and an exclamation mark is superimposed on the vehicle"}, "functional_descriptions": {"ground-truth": "This icon indicates that a fault has occurred in the vehicle's power system."}}, {"id": "30b2b1696564e828", "image_file": "30b2b1696564e828.png", "context": "Seatbelt reminder Someone in the car isn't wearing their seatbelt.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a seated person with a seatbelt across their chest and waist"}, "functional_descriptions": {"ground-truth": "The icon indicates that someone in the vehicle has not fastened their seat belt."}}, {"id": "40c4e4cc69c09a88", "image_file": "40c4e4cc69c09a88.png", "context": "Airbag fault warning A fault is detected with the airbags.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a seated person wearing a seatbelt with an inflated airbag in front of them"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has been detected in one of the vehicle's safety systems."}}, {"id": "001854b49ce8c200", "image_file": "001854b49ce8c200.png", "context": "Charging cable connected The charging cable is still connected to the car.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an electric cable with a plug on the end"}, "functional_descriptions": {"ground-truth": "This icon indicates that the charge connector is connected to the vehicle."}}, {"id": "30cc86b28eaad070", "image_file": "30cc86b28eaad070.png", "context": "Power steering failure The power steering system no longer works due to a fault. Stop driving as soon as it is safe to do so.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a steering wheel."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's power steering system is unavailable due to a system fault."}}, {"id": "00e070c88cccc8e0", "image_file": "00e070c88cccc8e0.png", "context": "Driver alert warning Flashing indicates that the Driver alert function senses you are tired and should take a break as soon as possible. A constant illumination indicates that there is a fault detected with the Driver alert system.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a cup and saucer. Three wavy lines above the cup represent the idea that the cup contains a hot drink."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s driver alert system is activated and sense the driver should take a break."}}, {"id": "40187c9aa0a8dc00", "image_file": "40187c9aa0a8dc00.png", "context": "Car status warning There is an important car status notification. Go to the car status view to see what the issue is and resolve it as soon as possible.", "difficulty": 5, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle as seen from the front. A checklist is superimposed on the vehicle."}, "functional_descriptions": {"ground-truth": "The icon indicates that there is an important car status notification that should be reviewed by the driver as soon as possible."}}, {"id": "30cc86e9f082cc71", "image_file": "30cc86e9f082cc71.png", "context": "Evasive manoeuvre warning Steering is temporarily enhanced during an evasive manoeuvre.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the letters \"EMA\" with a circle drawn around them."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's evasive manoeuvre system is actively assisting with steering of the vehicle."}}, {"id": "009030f488b01080", "image_file": "009030f488b01080.png", "context": "Rear auto brake failure There is a fault with the rear auto brake.", "difficulty": 5, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the letter \"P\" and an obstacle. Three curved lines are shown emanating from the letter \"P\" to the obstacle."}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a fault with the vehicle's rear automatic brake system."}}, {"id": "0479f030e686cc44", "image_file": "0479f030e686cc44.png", "context": "Artificial external sound error There is an issue with the car's artificial external sound.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a vehicle as seen from the side and a speaker with a line through it is shown above the vehicle."}, "functional_descriptions": {"ground-truth": "This icon indicates that a fault has occurred in the vehicle's artificial external sound system."}}, {"id": "00c0e0b9b8cc0e00", "image_file": "00c0e0b9b8cc0e00.png", "context": "Rear radar system active and working The rear radar system is active and working normally.", "difficulty": 5, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts two vehicles. One vehicle is in front and beside the other vehicle. Three curved lines are seen emanating from the front vehicle towards the rear vehicle."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's rear radar system is active and working."}}, {"id": "00694dd4d6929200", "image_file": "00694dd4d6929200.png", "context": "Lane keeping aid failure There is an issue with the lane keeping aid function.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a road with lane markings"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the Lane Keeping Aid."}}, {"id": "0070cea2e4501044", "image_file": "0070cea2e4501044.png", "context": "Front wiper failure A fault is detected with the front wipers.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a windshield with a window wiper."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the front rain sensor."}}, {"id": "00b2d49696ccf000", "image_file": "00b2d49696ccf000.png", "context": "Brake system warning A fault is detected in the brake system.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "00f2ce9ab2cef000", "image_file": "00f2ce9ab2cef000.png", "context": "Anti-lock braking system warning The anti-lock braking system is disengaged. The friction brakes still function but without anti-lock braking.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letters \"ABS\" with a circle drawn around them"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle's anti-lock braking system."}}, {"id": "9061e4cab6b47098", "image_file": "9061e4cab6b47098.png", "context": "Forward collision avoidance system warning There is an issue with the collision avoidance system at the front of the car.", "difficulty": 5, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts two vehicles. The front of one vehicle is close to the rear of the other vehicle and above the vehicles is a symbol representing a crash or collision."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s system for assistance during collision risks is not available or is working but performance of that system is reduced."}}, {"id": "004dd49292d66838", "image_file": "004dd49292d66838.png", "context": "Tyre pressure warning Constant illumination indicates low tyre pressure. If there is a system fault, the symbol will flash for a short while and then be constantly illuminated.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark surrounded by a U-shaped symbol that represents a tire"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that tire pressure is low. If the icon is flashing on and off it indicates a fault in the tire pressure management system of the vehicle."}}, {"id": "30ccccaaccc6cc8c", "image_file": "30ccccaaccc6cc8c.png", "context": "Electronic stability control alert Constant illumination indicates that there is a problem with electronic stability control. Flashing indicates that electronic stability control is intervening.", "difficulty": 5, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle as seen from the rear. Below the vehicle are two wavy lines that represent skid marks."}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates a fault in the vehicle’s stability system. If the icon is flashing on and off it indicates the stability system is active and working."}}, {"id": "3068ccc44c496168", "image_file": "3068ccc44c496168.png", "context": "Electronic stability control off Electronic stability control is turned off.", "difficulty": 5, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle as seen from the rear. Below the vehicle are two wavy lines that represent skid marks and the word “OFF” appears."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s dynamic stability control system is switched off. "}}, {"id": "30b070dcc8786860", "image_file": "30b070dcc8786860.png", "context": "Interior presence detection off The interior presence detection function is turned off.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a hemisphere with three curved lines emanating downwards. The word \"OFF\" appears below the lines."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's interior presence detection function is turned off."}}, {"id": "8002b8c4e66c8144", "image_file": "8002b8c4e66c8144.png", "context": "Reduced performance alert The car's performance is reduced.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a turtle"}, "functional_descriptions": {"ground-truth": "The icon indicates a temporary fault in the vehicle driveline, resulting in reduced performance of the vehicle."}}, {"id": "4824e49494e4240a", "image_file": "4824e49494e4240a.png", "context": "Rear fog light The rear fog light is on.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle fog light with three horizontal lines representing beams of light emanating from the fog light. The horizontal lines are bisected by a vertical wavy line representing fog and the horizontal lines appear to the right of the light, which indicates a rear light."}, "functional_descriptions": {"ground-truth": "The icon indicates that the rear fog lights are on."}}, {"id": "00e070c88cccd8e0", "image_file": "00e070c88cccd8e0.png", "context": "Driver alert system limitation Something is blocking the driver monitoring camera's view.", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a cup and saucer. Three wavy lines above the cup represent the idea that the cup contains a hot drink."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s driver alert system is activated but that something is blocking the camera's view of the driver."}}, {"id": "31cc86b28eaad071", "image_file": "31cc86b28eaad071.png", "context": "Power steering fault There is a fault with the power steering. The power steering system is working with reduced effect.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a steering wheel."}, "functional_descriptions": {"ground-truth": "The icon indicates that the performance of the vehicle's power steering system is reduced due to a system fault. The power steering system is still functional."}}, {"id": "60d0a0d866ccc0c0", "image_file": "60d0a0d866ccc0c0.png", "context": "Hill descent control is active The hill descent control function is active and working.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle’s speedometer. Below the speedometer is a vehicle as seen from the side. The vehicle is descending a slope."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s hill descent control system is active."}}, {"id": "286945d496b2e860", "image_file": "286945d496b2e860.png", "context": "Lane keeping aid off Lane keeping aid is turned off and lane keeping assistance is not provided.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a road with lane markings with the word \"OFF\" written below"}, "functional_descriptions": {"ground-truth": "The icon indicates that the Lane Keeping Aid is off."}}, {"id": "646051c4c4d06064", "image_file": "646051c4c4d06064.png", "context": "Manual levelling failure There is an issue with the manual levelling of the lights.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle headlight with four horizontal lines representing beams of light emanating from the headlight. Next to the vertical lines are two arrows, one arrow points up and the other points down."}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a fault with manual levelling of the vehicle’s lights."}}, {"id": "4892ccecd4cc8248", "image_file": "4892ccecd4cc8248.png", "context": "Position lights failure There is an issue with the position lights.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts two lights and each light symbol has three horizontal lines representing beams of light emanating from it"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle’s position lights."}}, {"id": "0278d4c2c6d49804", "image_file": "0278d4c2c6d49804.png", "context": "Passing beam failure There is an issue with the passing beam.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle headlight with five diagonal lines representing beams of light emanating from the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle's passing beam headlights."}}, {"id": "d8d4c2d6d4d8cce4", "image_file": "d8d4c2d6d4d8cce4.png", "context": "Automatic high beam failure There is an issue with the automatic high beam.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The word \"AUTO\" appears below the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the active high beam feature of the vehicle's headlights."}}, {"id": "02d8d4a28296d800", "image_file": "02d8d4a28296d800.png", "context": "Manual high beam failure There is an issue with the manual high beam.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the high beam headlights of the vehicle."}}, {"id": "d8d4c6d6d4d8cce4", "image_file": "d8d4c6d6d4d8cce4.png", "context": "Automatic high beam on The automatic high beam is on.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This blue dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The word \"AUTO\" appears below the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the active high beam feature of the headlights of the vehicle is activated and the headlights are on."}}, {"id": "02c8d4d6c2d4d802", "image_file": "02c8d4d6c2d4d802.png", "context": "Manual high beam The manual high beam is on.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This blue dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the high beam headlights of the vehicle are on."}}, {"id": "48a060caca60a048", "image_file": "48a060caca60a048.png", "context": "Left-hand direction indicator The left direction indicator is active and indicating a left turn. When there is a fault with the direction indicator, the symbol flashes twice as fast.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts an arrow pointing to the left"}, "functional_descriptions": {"ground-truth": "The icon indicates that the left turn signal is in use."}}, {"id": "840a88ccc4a80884", "image_file": "840a88ccc4a80884.png", "context": "Right-hand direction indicator The right direction indicator is active and indicating a right turn. When there is a fault with the direction indicator, the symbol flashes twice as fast.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts an arrow pointing to the right"}, "functional_descriptions": {"ground-truth": "The icon indicates that the right turn signal is in use."}}, {"id": "4882ccc4d4cc8228", "image_file": "4882ccc4d4cc8228.png", "context": "Position lights The position lights are on.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts two lights and each light symbol has three horizontal lines representing beams of light emanating from it"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s parking lights are on."}}, {"id": "00d8868386d49802", "image_file": "00d8868386d49802.png", "context": "Passing beam is active The passing beam is on.", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle headlight with five diagonal lines representing beams of light emanating from the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's passing beam headlights are on."}}, {"id": "00f0d492b2cef000", "image_file": "00f0d492b2cef000.png", "context": "Automatic hold is active The automatic hold braking function is active. The car automatically brakes while stationary.", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts the letter \"A\" with a circle drawn around it."}, "functional_descriptions": {"ground-truth": "This icon indicates that the vehicle's auto-hold brake function is active and brakes or parking brake are engaged"}}, {"id": "0094009498209000", "image_file": "0094009498209000.png", "context": "Ready The ready symbol appears when you put the car in a driving gear. It disappears when the car's speed exceeds walking pace. It reappears whenever the car slows down below the same threshold.", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts the word “READY”"}, "functional_descriptions": {"ground-truth": "This icon indicates that the electric vehicle is powered on and ready to drive."}}, {"id": "d8d4c2c6d4d8c8a4", "image_file": "d8d4c2c6d4d8c8a4.png", "context": "1", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The letter \"A\" appears next to the headlight."}, "functional_descriptions": {"ground-truth": "The icon indicates that the automatic high beam feature of the headlights of the vehicle is activated but the headlights are off."}}, {"id": "0074cca6e6543000", "image_file": "0074cca6e6543000.png", "context": "1", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a windshield with a window wiper. A single raindrop is shown on the windshield."}, "functional_descriptions": {"ground-truth": "The icon indicates that the rain sensor is activated."}}, {"id": "2060708c8c8cc8c0", "image_file": "2060708c8c8cc8c0.png", "context": "1", "difficulty": 2, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a cup and saucer. Three wavy lines above the cup represent the idea that the cup contains a hot drink."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s driver alert system is activated and senses the driver needs a rest."}}, {"id": "00c07010daa2cc40", "image_file": "00c07010daa2cc40.png", "context": "1", "difficulty": 3, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts the rear of a vehicle as seen from the side. The towbar or trailer hitch of the vehicle is shown, along with a double-ended arrow."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle's towbar is unlocked."}}, {"id": "60d0a09866ccc0c0", "image_file": "60d0a09866ccc0c0.png", "context": "1", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a vehicle’s speedometer. Below the speedometer is a vehicle as seen from the side. The vehicle is descending a slope."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s hill descent control system is enabled but not currently active."}}, {"id": "0000664bda380800", "image_file": "0000664bda380800.png", "context": "1", "difficulty": 3, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a two-wheeled vehicle trailer as seen from the side"}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a fault with the trailer attached to the vehicle."}}, {"id": "1030307842da9818", "image_file": "1030307842da9818.png", "context": "1", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a two-wheeled vehicle trailer as seen from the side. A rear-facing light is shown above the trailer."}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a fault with the lights of the trailer attached to the vehicle."}}, {"id": "03cccccc8696d401", "image_file": "03cccccc8696d401.png", "context": "See BATTERY CHARGE (RED) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a stylized car battery with “+” and “-” symbols representing positive and negative terminals of the battery"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the vehicle’s battery charging system."}}, {"id": "2043d6d498aa0020", "image_file": "2043d6d498aa0020.png", "context": "USA: See BRAKE (RED) .", "difficulty": 1, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the word “BRAKE”"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "4472d4d4d4ccf084", "image_file": "4472d4d4d4ccf084.png", "context": "Canada: See BRAKE (RED) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an exclamation mark with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "90b2b26155d4d4e8", "image_file": "90b2b26155d4d4e8.png", "context": "See CRITICAL WARNING MESSAGE (RED) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an exclamation mark with a triangle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon is the critical warning light and indicates that the driver should consult the warning message shown in the vehicle information display."}}, {"id": "80018a88a4b44124", "image_file": "80018a88a4b44124.png", "context": "USA: ELECTRIC PARKING BRAKE (EPB) (RED) .", "difficulty": 1, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the word “PARK”"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that the electric parking brake is activated. If the icon is flashing on and off it indicates that a fault has occurred in the parking brake."}}, {"id": "12f0dcd494ccf032", "image_file": "12f0dcd494ccf032.png", "context": "Canada: See ELECTRIC PARKING BRAKE (EPB) (RED) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts the letter “P” with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that the electric parking brake is activated. If the icon is flashing on and off it indicates that a fault has occurred in the parking brake."}}, {"id": "30305010d0d07168", "image_file": "30305010d0d07168.png", "context": "See ENGINE TEMPERATURE (RED) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a thermometer being dipped into a fluid"}, "functional_descriptions": {"ground-truth": "The icon indicates that the temperature of the vehicle’s engine is too high."}}, {"id": "4dccd496868aaa41", "image_file": "4dccd496868aaa41.png", "context": "See LANE KEEP ASSIST (RED) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This gray and red dashboard icon depicts a road with lane markings. One of the lane markings is shown in red."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle is crossing a lane marking without the appropriate turn signal being operated."}}, {"id": "5819a6c4d862710a", "image_file": "5819a6c4d862710a.png", "context": "See LOW OIL PRESSURE (RED) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an oil can, with a drop of oil dripping from the spout of the can"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s oil level is low."}}, {"id": "3030b0b270683230", "image_file": "3030b0b270683230.png", "context": "See SEAT BELT (RED) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a seated person with a seatbelt across their chest and waist"}, "functional_descriptions": {"ground-truth": "The icon indicates that someone in the vehicle has not fastened their seat belt."}}, {"id": "70707068686969b0", "image_file": "70707068686969b0.png", "context": "See ADAPTIVE FRONT LIGHTING SYSTEM (AFS) (AMBER) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts a vehicle headlight with five vertical lines representing beams of light emanating from the headlight. Next to the vertical lines are two arrows, one arrow points to the left and the other points to the right."}, "functional_descriptions": {"ground-truth": "The icon indicates that there is a fault with the vehicle’s adaptive front lighting system"}}, {"id": "62616060e9726848", "image_file": "62616060e9726848.png", "context": "See AIR BAG (YELLOW) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts a seated person wearing a seatbelt with an inflated airbag in front of them"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has been detected in one of the vehicle’s airbag systems."}}, {"id": "b16c44a4a2cec4ea", "image_file": "b16c44a4a2cec4ea.png", "context": "See ALL TERRAIN PROGRESS CONTROL (ATPC) (AMBER) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle’s speedometer, which is next to a depiction of a vehicle as seen from the side"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s progress control system is enabled"}}, {"id": "84b2ccd4d4ccf004", "image_file": "84b2ccd4d4ccf004.png", "context": "See ANTI-LOCK BRAKING SYSTEM (ABS) (AMBER) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letters “ABS” with a circle drawn around them"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle’s anti-lock braking system."}}, {"id": "b001d69c98aa002a", "image_file": "b001d69c98aa002a.png", "context": "USA: See BRAKE (AMBER) .", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the word “BRAKE”"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "84b0d4d4d4ccf004", "image_file": "84b0d4d4d4ccf004.png", "context": "Canada: See BRAKE (AMBER) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "4471e0ccc6cc7001", "image_file": "4471e0ccc6cc7001.png", "context": "See CHECK ENGINE (AMBER) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle’s combustion engine"}, "functional_descriptions": {"ground-truth": "This icon indicates that an emissions-related fault has been detected with the vehicle’s engine"}}, {"id": "30b2b2696928f069", "image_file": "30b2b2696928f069.png", "context": "See DRIVER CONDITION MONITOR (AMBER) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a cup and saucer. Three wavy lines above the cup represent the idea that the cup contains a hot drink."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s driver condition monitor system has detected that the driver is presenting signs of high fatigue levels."}}, {"id": "30b86868a9694aa8", "image_file": "30b86868a9694aa8.png", "context": "See DYNAMIC STABILITY CONTROL (DSC) (AMBER) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle as seen from the rear. Below the vehicle are two wavy lines that represent skid marks."}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates a fault in the vehicle’s dynamic stability control system and traction control system. If the icon is flashing on and off it indicates the dynamic stability control system is active and working."}}, {"id": "b0b0b2a9686a7062", "image_file": "b0b0b2a9686a7062.png", "context": "See DYNAMIC STABILITY CONTROL (DSC) OFF (YELLOW) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts a vehicle as seen from the rear. Below the vehicle are two wavy lines that represent skid marks and the word “OFF” appears."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s dynamic stability control system is switched off. "}}, {"id": "443069707069b204", "image_file": "443069707069b204.png", "context": "See EXTERNAL TEMPERATURE (AMBER) .", "difficulty": 1, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a snowflake"}, "functional_descriptions": {"ground-truth": "The icon indicates that temperature outside the vehicle is low enough that ice may be present on the road."}}, {"id": "306969d4b2b2b210", "image_file": "306969d4b2b2b210.png", "context": "See FOLLOW MODE (AMBER) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This gray dashboard icon depicts a road with lane markings. A vehicle is positioned between the lane markings and a double-ended arrow is shown below the vehicle"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s adaptive cruise control system is active and in follow mode"}}, {"id": "90b2b26955d4d4e8", "image_file": "90b2b26955d4d4e8.png", "context": "See GENERAL WARNING AND INFORMATION MESSAGE (AMBER) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark with a triangle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon is the general warning light and indicates that the driver should consult the non-critical warning message shown in the vehicle information display."}}, {"id": "c4f3a8c6c6c0c2e4", "image_file": "c4f3a8c6c6c0c2e4.png", "context": "See LOW FUEL WARNING (AMBER) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a fuel pump and an arrow pointing to the right"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s fuel level is low."}}, {"id": "582169d9d9692048", "image_file": "582169d9d9692048.png", "context": "See REAR FOG LIGHTS (AMBER) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle fog light with three horizontal lines representing beams of light emanating from the fog light. The horizontal lines are bisected by a vertical wavy line representing fog."}, "functional_descriptions": {"ground-truth": "The icon indicates that the rear fog lights are on."}}, {"id": "e96155d4d4546912", "image_file": "e96155d4d4546912.png", "context": "See TIRE PRESSURE MONITORING SYSTEM (TPMS) (YELLOW) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts an exclamation mark surrounded by a U-shaped symbol that represents a tire"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that tire pressure is low. If the icon is flashing on and off it indicates a fault in the tire pressure management system of the vehicle."}}, {"id": "70606561706969e8", "image_file": "70606561706969e8.png", "context": "See AUTO HIGH BEAM ASSIST (AHBA) (GREEN) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The word \"AUTO\" appears below the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the automatic high beam feature of the headlights of the vehicle is activated and the headlights are on."}}, {"id": "b26954d4f04c6d28", "image_file": "b26954d4f04c6d28.png", "context": "See AUTO STOP/START (GREEN) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts the letter “A” surrounded by a curving line with an arrow on one end"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s engine is shut down by the vehicle’s auto stop/start system."}}, {"id": "6064706955556968", "image_file": "6064706955556968.png", "context": "See CRUISE CONTROL (GREEN) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle’s speedometer with an arrow pointing at the needle of the speedometer"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s cruise control is active."}}, {"id": "10b0aa6971f0c4e0", "image_file": "10b0aa6971f0c4e0.png", "context": "See FORWARD ALERT (GREEN) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle as seen from the rear with a triangle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s forward alert system is active"}}, {"id": "a35944e4c4445982", "image_file": "a35944e4c4445982.png", "context": "See FRONT FOG LIGHTS (GREEN) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle fog light with three horizontal lines representing beams of light emanating from the fog light. The horizontal lines are bisected by a vertical wavy line representing fog."}, "functional_descriptions": {"ground-truth": "The icon indicates that the front fog lights are on."}}, {"id": "5032b269cce83170", "image_file": "5032b269cce83170.png", "context": "See GEARSHIFT (GREEN) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts an arrow pointing upwards with a plus sign drawn on top of the arrow"}, "functional_descriptions": {"ground-truth": "The icon indicates when it is recommended that the driver of the vehicle change gears (up-shift)."}}, {"id": "18316c4cd8e06448", "image_file": "18316c4cd8e06448.png", "context": "See HILL DESCENT CONTROL (HDC) (GREEN) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle as seen from the side. The vehicle is descending a slope."}, "functional_descriptions": {"ground-truth": "If the icon is on and steady this indicates that the vehicle’s hill descent control system has been selected and is active. If the icon flashes this indicates that the hill descent control system has been selected but the system is not active"}}, {"id": "4dccd496868aaa45", "image_file": "4dccd496868aaa45.png", "context": "See LANE KEEP ASSIST (GREEN) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a road with lane markings"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s lane keep assist feature is active and the system is tracking the lanes."}}, {"id": "518ee8f0f0e88631", "image_file": "518ee8f0f0e88631.png", "context": "See SIDE LIGHTS (GREEN) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts two stylized lights and each light symbol has three horizontal lines representing beams of light emanating from it"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s side lights are on."}}, {"id": "026854d0ec293054", "image_file": "026854d0ec293054.png", "context": "See TRAILER TURN SIGNALS (GREEN) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a two-wheeled vehicle trailer as seen from the side"}, "functional_descriptions": {"ground-truth": "The icon indicates that a trailer is attached and the turn signals of the trailer are working in conjunction with the vehicle’s turn signals."}}, {"id": "6810726161729028", "image_file": "6810726161729028.png", "context": "See TURN SIGNALS (GREEN) .", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts an arrow pointing to the right"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s right turn signal is in use."}}, {"id": "02c9c4c6c6c4c902", "image_file": "02c9c4c6c6c4c902.png", "context": "See HIGH BEAM (BLUE) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This blue dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the high beam headlights of the vehicle are on."}}, {"id": "30b2f0694dd0c4a6", "image_file": "30b2f0694dd0c4a6.png", "context": "See FOLLOW MODE OFF (GRAY) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This gray dashboard icon depicts a road with lane markings. A vehicle is positioned between the lane markings and the word “OFF” written below"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s adaptive cruise control system is disabled"}}, {"id": "b26cd4b0b0ecc9c9", "image_file": "b26cd4b0b0ecc9c9.png", "context": "See AUTO STOP/START INHIBIT (WHITE) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts the letter “A” surrounded by a curving line with an arrow on one end. A diagonal line is drawn through the letter “A”."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s auto stop/start system is active but that a vehicle system requires the engine to run"}}, {"id": "b269d4d4f4e870b5", "image_file": "b269d4d4f4e870b5.png", "context": "See AUTO STOP/START OFF (WHITE) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts the letter “A” surrounded by a curving line with an arrow on one end. The word “OFF” appears at the bottom of the icon."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s auto stop/start system is off."}}, {"id": "8811d2c629d8c849", "image_file": "8811d2c629d8c849.png", "context": "See AUTONOMOUS EMERGENCY (AEB) BRAKING (RED) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts stylized representations of two vehicles. The front of one vehicle is close to the rear of the other vehicle and above the vehicle is a symbol depicting a collision or crash."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s autonomous emergency braking system is active or a collision threat is detected."}}, {"id": "b2694cf0f0557032", "image_file": "b2694cf0f0557032.png", "context": "See STEERING INTERVENTION (RED) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a steering wheel"}, "functional_descriptions": {"ground-truth": "This icon indicates that the vehicle is providing an input into the steering of the vehicle."}}, {"id": "84b2ccdcd4cc7002", "image_file": "84b2ccdcd4cc7002.png", "context": "See ANTI-LOCK BRAKING SYSTEM (ABS) (YELLOW) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts the letters “ABS” with a circle drawn around them"}, "functional_descriptions": {"ground-truth": "The icon indicates a fault in the vehicle’s anti-lock braking system."}}, {"id": "19d2e4b9e8e8b2b0", "image_file": "19d2e4b9e8e8b2b0.png", "context": "See AUTONOMOUS EMERGENCY BRAKING (AEB) FAULT (YELLOW) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts stylized representations of two vehicles. The front of one vehicle is close to the rear of the other vehicle. Above the vehicles is a symbol representing a collision or crash and below the vehicles the word “OFF” is depicted."}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the vehicle’s Automatic Emergency Braking system."}}, {"id": "84b2d4d4d4cc7002", "image_file": "84b2d4d4d4cc7002.png", "context": "Canada: See BRAKE (YELLOW) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts an exclamation mark with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "847160ccc6cc7001", "image_file": "847160ccc6cc7001.png", "context": "See CHECK ENGINE (YELLOW) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts a vehicle’s combustion engine"}, "functional_descriptions": {"ground-truth": "This icon indicates that an emissions-related fault has been detected with the vehicle’s engine"}}, {"id": "70b2b2696d28f0e8", "image_file": "70b2b2696d28f0e8.png", "context": "See DRIVER CONDITION MONITOR (YELLOW) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts a cup and saucer. Three wavy lines above the cup represent the idea that the cup contains a hot drink."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s driver condition monitor system has detected that the driver is presenting signs of high fatigue levels."}}, {"id": "30b869e9a9694a28", "image_file": "30b869e9a9694a28.png", "context": "See DYNAMIC STABILITY CONTROL (DSC) (YELLOW) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts a vehicle as seen from the rear. Below the vehicle are two wavy lines that represent skid marks."}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates a fault in the vehicle’s dynamic stability control system and traction control system. If the icon is flashing on and off it indicates the dynamic stability control system is active and working."}}, {"id": "44b269707069b084", "image_file": "44b269707069b084.png", "context": "See EXTERNAL TEMPERATURE (YELLOW) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts a snowflake"}, "functional_descriptions": {"ground-truth": "The icon indicates that temperature outside the vehicle is low enough that ice may be present on the road."}}, {"id": "b269d4d4d4d46db0", "image_file": "b269d4d4d4d46db0.png", "context": "See GENERAL WARNING AND INFORMATION MESSAGE (YELLOW) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts the letter “i” with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon represents an information symbol and indicates that a non-critical problem has occurred in one of the vehicle’s systems."}}, {"id": "686869694d4dd4d4", "image_file": "686869694d4dd4d4.png", "context": "See LANE KEEP ASSIST OFF (GRAY) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This gray dashboard icon depicts a road with lane markings and the word “OFF” written below"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s lane keep assist system is switched off."}}, {"id": "c4d1a8c6c6c0c1e4", "image_file": "c4d1a8c6c6c0c1e4.png", "context": "See LOW FUEL WARNING (YELLOW) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts a fuel pump and an arrow pointing to the right"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s fuel level is low."}}, {"id": "66d6bae2e2aae266", "image_file": "66d6bae2e2aae266.png", "context": "See POWER STEERING FAULT (YELLOW) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts a steering wheel with an exclamation mark next to it"}, "functional_descriptions": {"ground-truth": "This icon indicates that a fault has occurred in the vehicle’s power steering system."}}, {"id": "9a2169d9d9e92084", "image_file": "9a2169d9d9e92084.png", "context": "See REAR FOG LIGHTS (YELLOW) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts a vehicle fog light with three horizontal lines representing beams of light emanating from the fog light. The horizontal lines are bisected by a vertical wavy line representing fog."}, "functional_descriptions": {"ground-truth": "The icon indicates that the rear fog lights are on."}}, {"id": "ced496b2b296cc61", "image_file": "ced496b2b296cc61.png", "context": "See TIRE PRESSURE MONITORING SYSTEM (TPMS) (YELLOW) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts an exclamation mark surrounded by a U-shaped symbol that represents a tire"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that tire pressure is low. If the icon is flashing on and off it indicates a fault in the tire pressure management system of the vehicle."}}, {"id": "59b4d4f8dcd4d2d4", "image_file": "59b4d4f8dcd4d2d4.png", "context": "See ADAPTIVE CRUISE CONTROL ACTIVE (GREEN) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle’s speedometer, which is next to a depiction of a vehicle as seen from the rear"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s adaptive cruise control is active."}}, {"id": "34d2c8a0ccd434ba", "image_file": "34d2c8a0ccd434ba.png", "context": "See ADAPTIVE SPEED LIMITER (GREEN) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle’s speedometer with a selection of lower speeds highlighted. The letters “ASL” appear below the speedometer."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s adaptive speed limiter feature is on."}}, {"id": "b2e869c8e44c6968", "image_file": "b2e869c8e44c6968.png", "context": "See ALL TERRAIN PROGRESS CONTROL (ATPC) (GREEN) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle’s speedometer, which is next to a depiction of a vehicle as seen from the side"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s all terrain progress control system is active."}}, {"id": "8000e6d2d2ee4110", "image_file": "8000e6d2d2ee4110.png", "context": "See BRAKE HOLD (GREEN) .", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts the word “HOLD”"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s brake hold junction is activated."}}, {"id": "a5b1d0d69b1c0689", "image_file": "a5b1d0d69b1c0689.png", "context": "See ECO COACH PEDAL NOT PRESSED (GREEN) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a shoe and the vehicle’s accelerator pedal as seen from the side. The foot is not touching the pedal."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s ECO coach system is active and that it is possible for the driver to lift off of the accelerator pedal."}}, {"id": "8961e1d89e1e018d", "image_file": "8961e1d89e1e018d.png", "context": "See ECO COACH PEDAL PRESSED (GREEN) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a shoe and the vehicle’s accelerator pedal as seen from the side. The foot is touching the pedal."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s ECO coach system is active."}}, {"id": "30b271d4f0aa3217", "image_file": "30b271d4f0aa3217.png", "context": "See FOLLOW MODE (GREEN) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a road with lane markings. a vehicle as seen from the rear is also shown, along with an arrow point between the vehicle and the bottom of the icon."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s adaptive cruise control system is active and in follow mode."}}, {"id": "30b571b072705270", "image_file": "30b571b072705270.png", "context": "See GEARSHIFT (GREEN) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This white and green dashboard indicator depicts the numbers “4”, “5”, “5” and “6”"}, "functional_descriptions": {"ground-truth": "The icon indicates when it is recommended that the driver of the vehicle change gears (up-shift)."}}, {"id": "306269656c586264", "image_file": "306269656c586264.png", "context": "See HILL DESCENT CONTROL (HDC) (GREEN) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle’s speedometer with a selection of lower speeds highlighted. Below the speedometer is a vehicle as seen from the side. The vehicle is descending a slope."}, "functional_descriptions": {"ground-truth": "If the icon is on and steady, this indicates that the vehicle’s hill descent control system is active. If the icon is flashing on and off, this indicates that the operating conditions of the hill descent control system are not being met."}}, {"id": "29dcd6e2c2d4c983", "image_file": "29dcd6e2c2d4c983.png", "context": "See LOW BEAM (GREEN) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight"}, "functional_descriptions": {"ground-truth": "The icon indicates that the low beam headlights of the vehicle are on."}}, {"id": "20d0c8a8c8ecbc34", "image_file": "20d0c8a8c8ecbc34.png", "context": "See SPEED LIMITER (GREEN) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle’s speedometer with a selection of lower speeds highlighted. The letters “LIM” appear below the speedometer."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s speed limiter feature is active."}}, {"id": "71cc86b29696cc71", "image_file": "71cc86b29696cc71.png", "context": "See STEERING ASSIST ACTIVE (GREEN) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a steering wheel"}, "functional_descriptions": {"ground-truth": "This icon indicates that the vehicle’s steering assistance system is active and making adjustments to the steering of the vehicle."}}, {"id": "7861646478786865", "image_file": "7861646478786865.png", "context": "See AUTO HIGH BEAM (BLUE) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The word “AUTO” appears below the headlight."}, "functional_descriptions": {"ground-truth": "The icon indicates that either the vehicle’s Auto High Beam Assist or Adaptive Driving Beam features are active and the high beams are on."}}, {"id": "87716d6d616e6999", "image_file": "87716d6d616e6999.png", "context": "See PARK ASSIST AUTO SEARCH (BLUE) .", "difficulty": 1, "visual_descriptions": {"ground-truth": "This blue dashboard icon depicts the letter “P”"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s park assist system is searching for a valid parking space."}}, {"id": "1852e4b1e8e8b2b0", "image_file": "1852e4b1e8e8b2b0.png", "context": "See AUTONOMOUS EMERGENCY (AEB) BRAKING (GRAY) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This gray dashboard icon depicts stylized representations of two vehicles. The front of one vehicle is close to the rear of the other vehicle. Above the vehicles is a symbol representing a collision or crash and below the vehicles the word “OFF” is depicted."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s Automatic Emergency Braking with Pedestrian Detection system is disabled."}}, {"id": "686869694d4dc4d4", "image_file": "686869694d4dc4d4.png", "context": "See LANE KEEP ASSIST STANDBY (GRAY) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This gray dashboard icon depicts a road with lane markings"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s lane keep assist feature is active but no lane boundaries are being monitored by the system."}}, {"id": "30cc86b29696cc71", "image_file": "30cc86b29696cc71.png", "context": "See STEERING ASSIST NOT ACTIVE (GRAY) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This gray dashboard icon depicts a steering wheel"}, "functional_descriptions": {"ground-truth": "This icon indicates that the vehicle’s steering assistance system is not active."}}, {"id": "7865646578786865", "image_file": "7865646578786865.png", "context": "See AUTO HIGH BEAM (WHITE) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a vehicle headlight with five horizontal lines representing beams of light emanating from the headlight. The word “AUTO” appears below the headlight."}, "functional_descriptions": {"ground-truth": "The icon indicates that either the vehicle’s Auto High Beam Assist or Adaptive Driving Beam features are active but that the high beams are off."}}, {"id": "30b068b070786864", "image_file": "30b068b070786864.png", "context": "See AUTO LIGHTS (WHITE) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a light bulb above the word “AUTO”"}, "functional_descriptions": {"ground-truth": "The icon indicates that the exterior lighting control is set to automatic mode."}}, {"id": "629974e878f4c803", "image_file": "629974e878f4c803.png", "context": "See LOW TRACTION LAUNCH (WHITE) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a vehicle wheel on an uneven surface. There is an arrow next to the wheel, showing that the wheel is moving."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s low traction launch system is active."}}, {"id": "30c4d8b2a6cc6982", "image_file": "30c4d8b2a6cc6982.png", "context": "See TIRE PRESSURE MONITORING SYSTEM (TPMS) LIGHT LOAD (WHITE) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a feather surrounded by a U-shaped symbol that represents a tire"}, "functional_descriptions": {"ground-truth": "The icon indicates that the light load setting of the tire pressure monitoring system is selected."}}, {"id": "5934e4ccc4c9c2c0", "image_file": "5934e4ccc4c9c2c0.png", "context": "See CHARGING STATUS (RED) .", "difficulty": 1, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts an electric cable with a plug on the end"}, "functional_descriptions": {"ground-truth": "This icon indicates that a fault has occurred with the vehicle’s charging system."}}, {"id": "3032b168785969f8", "image_file": "3032b168785969f8.png", "context": "See DIESEL EXHAUST FLUID (DEF) (RED) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts two horizontal lines representing emissions from the vehicle. Two drops of fluid are shown on top of the horizontal lines with a wavy line at the bottom."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s diesel exhaust fluid levels are seriously low."}}, {"id": "b4d1f0dab6b6c8e4", "image_file": "b4d1f0dab6b6c8e4.png", "context": "See HYBRID SYSTEM BATTERY FAULT (RED) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a stylized car battery with “+” and “-” symbols representing positive and negative terminals of the battery. An exclamation mark is superimposed on the battery."}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the vehicle’s hybrid high voltage system."}}, {"id": "2832b16c785969e8", "image_file": "2832b16c785969e8.png", "context": "See DIESEL EXHAUST FLUID (DEF) (AMBER) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts two horizontal lines representing emissions from the vehicle. Two drops of fluid are shown on top of the horizontal lines with a wavy line at the bottom."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s diesel exhaust fluid levels are low."}}, {"id": "b269d4d4d4d46db1", "image_file": "b269d4d4d4d46db1.png", "context": "See GENERAL WARNING AND INFORMATION MESSAGE (AMBER) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letter “i” with a circle drawn around it"}, "functional_descriptions": {"ground-truth": "The icon represents an information symbol and indicates that a non-critical problem has occurred in one of the vehicle’s systems."}}, {"id": "01f4e855d4686912", "image_file": "01f4e855d4686912.png", "context": "See GLOW PLUGS (AMBER) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a coiling line representing the vehicle’s glow plugs."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s glow plugs are active"}}, {"id": "ccd496b2b296cc61", "image_file": "ccd496b2b296cc61.png", "context": "See TIRE PRESSURE MONITORING SYSTEM (TPMS) (AMBER) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts an exclamation mark surrounded by a U-shaped symbol that represents a tire"}, "functional_descriptions": {"ground-truth": "If the icon is on and steady it indicates that tire pressure is low. If the icon is flashing on and off it indicates a fault in the tire pressure management system of the vehicle."}}, {"id": "59b4e4ccc469c2c0", "image_file": "59b4e4ccc469c2c0.png", "context": "See CHARGING STATUS (GREEN) .", "difficulty": 1, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts an electric cable with a plug on the end"}, "functional_descriptions": {"ground-truth": "This icon indicates that the vehicle is charging."}}, {"id": "28d0d2e9694c6ce0", "image_file": "28d0d2e9694c6ce0.png", "context": "See LOW RANGE (GREEN) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts the letters “LO” next to a mountain range"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s low range gear ratio is selected."}}, {"id": "70c8d595d8d868b8", "image_file": "70c8d595d8d868b8.png", "context": "See TIMED CHARGING (BLUE) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This blue dashboard icon depicts the two hands of a clock (in the shape of the letter “L”) surrounded by an electric cable with a plug on one end"}, "functional_descriptions": {"ground-truth": "The icon indicates that a timed charging event is scheduled."}}, {"id": "5834e4ccc449c2c9", "image_file": "5834e4ccc449c2c9.png", "context": "See CHARGING STATUS (WHITE) .", "difficulty": 1, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts an electric cable with a plug on the end"}, "functional_descriptions": {"ground-truth": "This icon indicates that the vehicle is connected to an external charger and the charging process is initiating or paused."}}, {"id": "70b2f06c4ce8f000", "image_file": "70b2f06c4ce8f000.png", "context": "See DRIVER CONDITION MONITOR (WHITE) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a cup and saucer. Three wavy lines above the cup represent the idea that the cup contains a hot drink."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s driver alert system is activated."}}, {"id": "0001d6d490aa0088", "image_file": "0001d6d490aa0088.png", "context": "USA: See BRAKE (YELLOW) .", "difficulty": 1, "visual_descriptions": {"ground-truth": "This yellow dashboard icon depicts the word “BRAKE”"}, "functional_descriptions": {"ground-truth": "The icon indicates that a fault has occurred in the brake system of the vehicle."}}, {"id": "54d5adad2da4b632", "image_file": "54d5adad2da4b632.png", "context": "See CORNER SPEED ADAPTATION (GREEN) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a road with lane markings. The lane is curving off in one direction."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s adaptive cruise control system and the corner speed adaptation feature are active, and that the system has detected that the road requires a reduction in the vehicle’s speed."}}, {"id": "28d0d2e9694c6c68", "image_file": "28d0d2e9694c6c68.png", "context": "See LOW RANGE (GREEN) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts the letters “LO” next to a mountain range"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s low range gear ratio is selected."}}, {"id": "70ccd4cc6932b430", "image_file": "70ccd4cc6932b430.png", "context": "See SPEED LIMIT ADAPTATION (GREEN) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a circle with a single line below it. This is meant to be a speed limit sign."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle has detected a lower speed limit on the road ahead."}}, {"id": "b269c4d0f0d471b2", "image_file": "b269c4d0f0d471b2.png", "context": "See STEERING ASSIST ACTIVE (GREEN) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a steering wheel"}, "functional_descriptions": {"ground-truth": "This icon indicates that the vehicle’s steering assistance system is active and making adjustments to the steering of the vehicle."}}, {"id": "b269d4f0f0d471b2", "image_file": "b269d4f0f0d471b2.png", "context": "See STEERING ASSIST NOT ACTIVE (GRAY) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This gray dashboard icon depicts a steering wheel"}, "functional_descriptions": {"ground-truth": "This icon indicates that the vehicle’s steering assistance system is not active."}}, {"id": "30b069f070707862", "image_file": "30b069f070707862.png", "context": "See EXTERIOR LIGHTS OFF (WHITE) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a light bulb above the word “OFF”"}, "functional_descriptions": {"ground-truth": "The icon indicates that the exterior lighting control is set to off."}}, {"id": "4c7930d698dc4c32", "image_file": "4c7930d698dc4c32.png", "context": "See ROOF LOAD (WHITE) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This white dashboard icon depicts a vehicle as seen from the side. An object is placed on the roof of the vehicle and a diagonal line is drawn through the vehicle."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s sport mode is enabled and the vehicle should not be driven with a roof load"}}, {"id": "9068616068597968", "image_file": "9068616068597968.png", "context": "See SPEED LIMITER (AMBER) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle’s speedometer with a selection of lower speeds highlighted. The letters “LIM” appear below the speedometer."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle’s speed limiter feature."}}, {"id": "62695c60606460f2", "image_file": "62695c60606460f2.png", "context": "See LOW FUEL WARNING (AMBER) .", "difficulty": 2, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a fuel pump"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s fuel level is low."}}, {"id": "30b068e8d9b1f978", "image_file": "30b068e8d9b1f978.png", "context": "See ALL SURFACE PROGRESS CONTROL (ASPC) (AMBER) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle’s speedometer, which is next to a depiction of a vehicle as seen from the rear"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s all surface progress control system is active"}}, {"id": "b269696969b032b0", "image_file": "b269696969b032b0.png", "context": "See ECO STOP/START OFF (AMBER) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts the letters “ECO” surrounded by a curving line with an arrow on one end. The word “OFF” is written below."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s engine is running and the vehicle’s automatic ECO stop/start system is disabled."}}, {"id": "9068616068797960", "image_file": "9068616068797960.png", "context": "See SPEED LIMITER (AMBER) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle’s speedometer with a selection of lower speeds highlighted. The letters “LIM” appear below the speedometer."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle’s speed limiter feature."}}, {"id": "b269cce4ecd44d6d", "image_file": "b269cce4ecd44d6d.png", "context": "See ECO STOP/START (GREEN) .", "difficulty": 3, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts the letters “ECO” surrounded by a curving line with an arrow on one end"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s engine is shut down by the vehicle’s automatic ECO stop/start system."}}, {"id": "39a424e4d0185934", "image_file": "39a424e4d0185934.png", "context": "See ALL SURFACE PROGRESS CONTROL (ASPC) (GREEN) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a vehicle’s speedometer, which is next to a depiction of a vehicle as seen from the rear"}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s all surface progress control system is active."}}, {"id": "4c4ce4e45c506054", "image_file": "4c4ce4e45c506054.png", "context": "See LANE DEPARTURE WARNING (RED) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This red dashboard icon depicts a road with lane markings. A vehicle is positioned between the lane markings but is crossing over the left marking."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s lane departure system is enabled and the vehicle has crossed a lane marking without the appropriate turn signal being used"}}, {"id": "18c1c0c0c538b935", "image_file": "18c1c0c0c538b935.png", "context": "See ADAPTIVE SPEED LIMITER (AMBER) .", "difficulty": 5, "visual_descriptions": {"ground-truth": "This amber dashboard icon depicts a vehicle’s speedometer with a selection of lower speeds highlighted. The letters “LIM” appear below the speedometer."}, "functional_descriptions": {"ground-truth": "The icon indicates a fault with the vehicle’s adaptive speed limiter feature."}}, {"id": "5454687049e0f0d4", "image_file": "5454687049e0f0d4.png", "context": "See LANE DEPARTURE WARNING (GREEN) .", "difficulty": 4, "visual_descriptions": {"ground-truth": "This green dashboard icon depicts a road with lane markings. A vehicle is positioned between the lane markings."}, "functional_descriptions": {"ground-truth": "The icon indicates that the vehicle’s lane departure system is enabled"}}]
